---
title: "Security: ASA 방화벽의 접속과 ACL"
last_modified_at: 2020-08-21T20:20:02-05:00
categories:
  - Security
tags:
  - Firewall
  - ASA
  - ACL
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 방화벽 접속 제어
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_basic3.jpg" alt="">
  <figcaption> </figcaption>
</figure>

방화벽을 제어하기 위하여 콘솔, 텔넷, SSH, ASDM 및 VPN을 통해 방화벽에 접속할 수 있다. 
(콘솔이 유일한 로컬이다)
{: .notice}

---
#### Telnet을 통한 ASA 접속
---

암호가 없으면 원격 접속을 할 수 없다.
{: .notice}

```console
FW1# conf t
FW1(config)# enable password cisco123
FW1(config)# exit
FW1# exit

Logoff

Type help or '?' for a list of available commands.
FW1> enable
Password: ********
FW1#
```

enable password 명령어를 이용하여 enable에 대한 암호를 설정해준다. 
 여기서 말하는 enable은 privilege 모드의 암호를 설정하는 것이고 telnet을 이용하기 위해서는
 User Exec 암호 설정이 필요하다. 그래서 다음과 같이 패스워드를 한번 더 설정한다.
{: .notice}

```console
FW1# conf t
FW1(config)# passwd cisco
```

기본적으로 라우터는 패스워드만 맞으면 모든 장비에서 접속을 할 수 있지만 ASA 장비는 모든 접속을 거부하는 정책을 가져서
사용할 일부분을 허용해줘야한다. 이때 10.10.10.10으로 부터의 접속만 허용하려면 무엇을 해야할까? ACL 설정을 해줘야 한다.
{: .notice}

```console
# ip access-list statndard acl_host
# permit host 10.10.10.10
//acl 생성
# line vty 0 4
# ip access-classs acl_host
//acl 적용
# telnet 10.10.10.0 255.255.255.0 inside
//Telnet 허용
```
* access-list를 통해서 10.10.10.10으로 부터 오는 패킷을 모두 허용한다.
* access-classs를 통해서 더 편리하게 적용할 수 있다. (설정할 값들이 많은 경우)
* 10.10.10.0 대역에서 inside 방향으로의 telnet 접근을 허용한다.
* telnet만 허용할 경우 acl 없이 telnet 10.10.10.0 255.255.255.0 inside만 해주면 된다.
{: .notice}

* enable password cisco123 #enable에 대한 패스워드 설정
* passwd cisco #telnet에 대한 패스워드 설정
* telent x.x.x.x 255.255.255.0 inside #Telent 허용
{: .notice--info}

만약, R2(1.1.20.2) 에서 FW1 outside(1.1.20.10)으로 접속을 시도한다면 어떻게 될까?
{: .notice--warning}

```console
FW1# conf t
FW1(config)# telnet 1.1.20.2 255.255.255.255 outside
FW1(config)# show run telnet
telnet 10.10.10.0 255.255.255.0 inside
telnet 1.1.20.2 255.255.255.255 outside
telnet timeout 5
```

```console
R2#telnet 1.1.20.10
Trying 1.1.20.10 ...
% Connection timed out; remote host not responding
```

보안 레벨이 가장 낮은 인터페이스는 접속을 할 수 없다. outside 가 default 0으로 최저값을 
가지기 때문에 보안 레벨을 일시적으로 올려서 해결 할 수 있다.
{: .notice--warning}

```console
FW1(config)# show run int gi0/0
!
interface GigabitEthernet0/0
 nameif inside
 security-level 100
 ip address 10.1.10.10 255.255.255.0
FW1(config)# show run int gi0/1
!
interface GigabitEthernet0/1
 nameif outside
 security-level 0
 ip address 1.1.20.10 255.255.255.0
```

inside는 100 outside는 0 이 default security-level 이다.
{: .notice--warning}

---
#### SSH를 통한 ASA 접속
---

SSH는 인증 기능을 제공하기 때문에 Telnet과는 다르게 Security-level이 가장 낮은 인터페이스를 통해서도 접속이 가능하다. 
{: .notice--info}

```console
FW1(config)# aaa authentication telnet console ?

configure mode commands/options:
  LOCAL  Predefined server tag for AAA protocol 'local'
  WORD   Name of RADIUS or TACACS+ aaa-server group for administrative
         authentication

FW1(config-if)# username admin password cisco123
FW1(config)# aaa authentication telnet console LOCAL
```
* telnet에도 위와 같이 (aaa authentication) 인증 설정을 할 수있다.
* RADIUS 나 TACACS 는 계정 정보를 가진 서버라고 생각하면 쉽다.
{: .notice}

다시 돌아와서 ssh 접속을 해보자. 아래와 같이 인증 설정과 허용할 ip 대역대를 지정하면 외부에서도 접속이 가능하다.
{: .notice}

```console
FW1(config)# username admin password cisco123
FW1(config)# aaa authentication ssh console LOCAL
FW1(config)# crypto key generate rsa modulus 1024

FW1(config)# ssh 10.10.10.10 255.255.255.255 inside
FW1(config)# ssh 1.1.20.2 255.255.255.255 outside

R2#ssh -l admin 1.1.20.10

Password:
Password:
Type help or '?' for a list of available commands.
FW1>
FW1> exit

R1#ssh -l admin 10.1.10.10
```

---
### 액세스 리스트
---

기존의 라우터에서 했던 설정 방식을 살펴보자
{: .notice}

```
ip access-group 100 in
ip access-group acl-inside-http in
ip access-group acl-outside-http in

ip access-list extended acl-inside-http
permit ip host 1.1.1.1 any
```

asa 장비에서는 interface 이름 대신에 nameif outside, inside와 같이 이름을 사용한다.
{: .notice}

```console
permit ip any host 1.1.20.1
permit ip any host server_mail eq 25 //이렇게 말이다.
```

---
#### L2-L4 패킷 필터링
---

* 방화벽의 액세스리스트와 라우터의 ACL은 비슷하다.
* 기본적으로 ACL 설정에 따라 트래픽의 L2/L3/L4 정보를 분석하여 차단, 허용하는 용도로 사용한다.
* 또한, NAT VPN 루트맵 설정에서 IP 주소를 지정하기 위한 용도로도 사용한다.
{: .notice}

* 표준 액세스 리스트
	* 라우터와 마찬가지로 목적지 IP주소를 기반으로 패킷을 식별한다.
	* 트래픽 필터링을 위해 인터페이스에 적용할 수 없다.
	* OSPF 재분배를 위한 루트맵, 리모트 액세스 VPN 설정에만 사용된다.
	* 라우터 모드에서만 사용할 수 있다.
* 확장 액세스 리스트
	* 방화벽에서 가장 많이 사용하는 액세스 리스트
	* 출발지/목적지 IP, 프로토콜 종류, 출발지/목적지 포트 번호로 트래픽 제어
	* AAA 정책, VPN, NAT 설정 등 다양한 곳에서 사용
	* 라우터, 트랜스패런트 모드 둘다 사용 가능하다.
* 이더타입 액세스 리스트
	* 이더 타입 (이더넷 ID, 타입 번호)
	* 트랜스패런트 모드에서 사용하는 ACL로 L2 헤더를 이용하여 트래픽을 제어한다.
	* IPX, BPDU, MPLS 패킷 같은 IP 기반 프로토콜들을 제어 할 수 있다.
* IPv6 액세스 리스트
	* IPv6 트래픽 제어
* 웹 타입 액세스 리스트
	* 클라이언트리스 SSL VPN의 트래픽을 제어하기 위하여 사용한다.
{: .notice}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_acl1.jpg" alt="">
  <figcaption> </figcaption>
</figure>
























