---
title: "Network: HSRP와 DHCP"
last_modified_at: 2020-07-14T20:20:02-05:00
categories:
  - Network
tags:
  - DHCP
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 토폴로지 설정 (SVI)
---

<figure class="half">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/DHCP.JPG" alt="">
  <figcaption>기본 토폴로지 설정</figcaption>
</figure> 

```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f 0/0
R1(config-if)#ip address 1.1.111.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#int f 0/1
R1(config-if)#ip address 1.1.112.1 255.255.255.0
R1(config-if)#no shut
```

L2 인터페이스에는 주소를 부여할 수 없다. 이를 위해 **VLAN을 대표하여 주소를 부여 할 수 있는 L3 인터페이스가 SVI**다. SW1과 SW2에 그냥 주소를 부여하려하면 불가능하다. vlan 설정을 해주고 주소를 부여해준다.
{: .notice}

```
SW1(config)#int vlan 100
SW1(config-if)#ip address 1.1.100.11 255.255.255.0
SW1(config-if)#no shut

SW1(config)#int e 0/1
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 100
SW1(config-if)#end
```

```
SW2(config)#int vlan 100
SW2(config-if)#ip address 1.1.100.12 255.255.255.0
SW2(config-if)#no shut

SW2(config)#int e 0/1
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 100
SW2(config-if)#exit
```
SW1과 SW2에 성공적으로 SVI 100을 생성하였다
{: .notice}

```
SW1#show ip int brief vlan 100
Interface              IP-Address      OK? Method Status                Protocol
Vlan100                1.1.100.11      YES manual up                    up

SW2#show ip int brief vlan 100
Interface              IP-Address      OK? Method Status                Protocol
Vlan100                1.1.100.12      YES manual up                    up
```

연결이 잘 되었나 확인 
{: .notice}
```
SW1#ping 1.1.100.12
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.100.12, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
SW1#
```

---
### L3 스위칭 (SVI, 라우티드 포트)
---

* SW1 , SW2를 분배 스위치라 하고 SW3를 액세스 스위치라고 하자
* 분배 스위치는 명령에 의해 라우팅을 싱행하고 액세스 스위치에게 트래픽을 분배 한다
* R1은 인터넷 라우터라고 부르고 코어 라우팅을 한다고 할 수 있다 
{: .notice}

* L3 스위치에서 라우팅을 설정하려면 L3 인터페이스를 만들어야 한다
* L3 인터페이스는 크게 SVI(Switched Virtual Interface)와 라우티드 포트(routed port)로 나눈다
	* SVI는 VLAN을 대표하는 L3 인터페이스 
	* 라우티드 포트는 스위치 포트를 라우터 포트 처럼 동작시키는 것을 말한다
{: .notice}

* SVI는 VLAN에 IP를 할당해주어 사용하는 개념인데 논리적인 브로드 캐스트 그룹을 생성한다
* 라우티드 포트는 스위치 포트를 L3 인터페이스로 전환하는 개념이라고 보면 된다
	* 주로 L3 스위치와 라우터 또는 L3 스위치 끼리 연결할때 사용한다
{: .notice}

---
### 라우티드 포트 설정
---

```
SW1(config)#int e 0/0
SW1(config-if)#no switchport
SW1(config-if)#ip address 1.1.111.11 255.255.255.0
```
```
SW2(config)#int e 0/0
SW2(config-if)#no switchport
SW2(config-if)#ip add 1.1.112.12 255.255.255.0
```
```
R1(config)#int lo0
R1(config-if)#ip address 1.1.1.1 255.255.255.0
R1(config-if)#exit

R1(config)#int f 0/1
R1(config-if)#ip address 1.1.112.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#exit

R1(config)#int f 0/0
R1(config-if)#ip address 1.1.111.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#exit

```

연결이 잘 되었는지 확인 한다 
{: .notice}

```
R1#ping 1.1.111.11

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.111.11, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 12/16/24 ms
R1#ping 1.1.112.12

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.112.12, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 8/14/24 ms
```

---
### 라우팅 설정
---

```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 1.1.1.1 0.0.0.0 area 0
R1(config-router)#network 1.1.111.1 0.0.0.0 area 0
R1(config-router)#network 1.1.112.1 0.0.0.0 area 0
```

```
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#ip routing
SW1(config)#router ospf 1
SW1(config-router)#router-id 1.1.11.11
SW1(config-router)#network 1.1.111.11 0.0.0.0 area 0
SW1(config-router)#network 1.1.100.11 0.0.0.0 area 0
SW1(config-router)#passive-interface vlan 100
```

```
SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#ip routing
SW2(config)#router ospf 1
SW2(config-router)#router-id 1.1.12.12
SW2(config-router)#network 1.1.112.12 0.0.0.0 area 0
SW2(config-router)#network 1.1.100.12 0.0.0.0 area 0
SW2(config-router)#passive-interface vlan 100
```

```
R1(config-router)#do show ip route ospf
     1.0.0.0/24 is subnetted, 4 subnets
O       1.1.100.0 [110/11] via 1.1.112.12, 00:00:13, FastEthernet0/1
                  [110/11] via 1.1.111.11, 00:00:23, FastEthernet0/0
R1(config-router)#
```

```
SW1(config-router)#do show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/8 is variably subnetted, 6 subnets, 2 masks
O        1.1.1.1/32 [110/11] via 1.1.111.1, 00:00:39, Ethernet0/0
O        1.1.112.0/24 [110/20] via 1.1.111.1, 00:00:29, Ethernet0/0
```

---
### HSRP
---

**FHRP(First Hop Redundancy Protocol)**란? 게이트웨이 역할을 하는 라우터나 레이어3 스위치를 복수 개로 구성하고
하나가 다운되면 다른 하나가 계속 수행하게 하는 프로토콜이다. 게이트웨이 이중화 프로토콜 이라고도 부른다.
여기에 해당하는 프로토콜로 **HSRP, VRRP, GLBP** 등이 있다.
{: .notice}

* 각각의 명령어
* vrrp 1 ip 1.1.100.x
* blbp 1 ip 1.1.100.x
* standby 1 ip 1.1.100.x
{: .notice}

* HSRP 동작 방식
* HSRP가 사용하는 가상의 IP주소를 게이트웨이 주소로 설정한다 (VIP 라고 부른다)
* HSRP 장비 중에서 하나가 active 라우터 역할을 하고 게이트웨이 주소가 목적지인 프레임을 처리한다
* standby는 액티브 라우터를 감시하고 다운되면 액티브 라우터의 역할을 이어받아 게이트 웨이 역할을 한다
* active 라우터가 주기적으로 Hello를 보내는데 이 패킷이 안오면 standby가 VIP를 가져가고 연결된 SW에 mac주소는 자신의 mac주소로 학습시킨다
* HSRP 버전 1은 vlan 최개 255개 밖에 못만든다 버전2는 4095개로 확장되었다 
		* Mac주소에 그룹번호가 들어가는데 버전1은 0000.0c07.acNN 버전2는 0000.0c9f.fNNN (N자리에 들어간다)
{: .notice}

```
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int vlan 100
SW1(config-if)#standby 1 ip 1.1.100.254
SW1(config-if)#standby 1 priority 105
SW1(config-if)#standby 1 preempt
SW1(config-if)#
SW1(config-if)#end
```

Active 선출 기준에 IP 주소가 큰 것이 선출된다는 조건이 있어서 priority를 105로 설정해서(Default 110) Active 가 되도록한다 
{: .notice}
```
SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int vlan 100
SW2(config-if)#standby 1 ip 1.1.100.254
SW2(config-if)#standby 1 preempt
SW2(config-if)#
SW2(config-if)#end
```
```
SW1#show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Vl100       1    105 P Active  local          1.1.100.12      1.1.100.254
```
* Grp 1 : 그룹 번호
* Pri 105 : 우선순위
* P : Preemption 조건 충족시 다시 Active 라우터 역할을 받아오도록함
* Active local : 현재 스위치가 액티브 라우터 임을 알림
* Standby : Standby IP 주소를 나타냄
* Virtual IP : 가상 IP 주소
{: .notice--warning}
```
SW2#show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Vl100       1    100 P Standby 1.1.100.11      local           1.1.100.254
```

SW1이 Active 라우터인 것이 나타남
{: .notice}
```
SW1#show standby
Vlan100 - Group 1
  State is Active
    2 state changes, last state change 00:01:20
  Virtual IP address is 1.1.100.254
  Active virtual MAC address is 0000.0c07.ac01 (MAC In Use)
    Local virtual MAC address is 0000.0c07.ac01 (v1 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.584 secs
  Preemption enabled
  Active router is local
  Standby router is 1.1.100.12, priority 100
  Priority 105 (configured 105)
  Group name is "hsrp-Vl100-1" (default)
```

SW1을 껐을 때, SW2에서 Standby -> Active 상태로 바뀐다.
{: .notice}

```
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int e 0/1
SW1(config-if)#shutdown
```
```
*Jul 24 00:37:33.423: %HSRP-5-STATECHANGE: Vlan100 Grp 1 state Standby -> Active
```

자꾸 스위치가 서로 인식을 못해서 둘다 Active가 되어 no ip igmp snooping 명령어를 각각 입력하여 해결했다.
{: .notice--danger}




---
### DHCP
---










