---
title: "OSPF(Open Shortest Path First)"
last_modified_at: 2020-06-01T20:20:02-05:00
categories:
  - Network
tags:
  - Routing protocol
  - OSPF
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### OSPF 테스트 네트워크 구축
---

* OSPF는 Link state 라우팅 프로토콜이다
* 전체 네트워크 구성파악을 위해 필요한 정보들을 광고한다
* IP 패킷에서 프로토콜 번호 89번을 사용한다
* area 단위로 라우팅을 동작 시킨다
* area는 큰 규모에서 안정된 운영을 할 수 있도록 한다
{: .notice}

OSPF를 테스트할 네트워크를 구축하자
{: .notice}
```
SW1(config)# vlan 123,40
SW1(config-vlan)# exit

SW1 (config)# interface range f1/1-3
SW1 (config-if-range)# switchport mode access
SW1 (config-if-range)# switchport access vlan 123
SW1 (config-if-range)# exit

SW1 (config)# interface f1/4
SW1 (config-if)# switchport mode access
SW1 (config-if)# switchport access vlan 40
SW1 (config-if)# exit
```

```
SW2(config)# vlan 10,24
SW2(config-vlan)# exit

SW2(config)# interface f1/1
SW2(config-if)# switchport mode access
SW2(config-if)# switchport access vlan 10
SW2(config-if)# exit

SW2(config)# interface range f1/2, f1/4
SW2(config-if-range)# switchport mode access
SW2(config-if-range)# switchport access vlan 24
SW2(config-if-range)# exit
```

```
R1(config)# interface f0/1
R1(config-if)# ip address 1.1.10.1 255.255.255.0
R1(config-if)# no shut
R1(config-if)# interface f0/0
R1(config-if)# ip address 1.1.123.1 255.255.255.0
R1(config-if)# no shut
```

```
R2(config)# interface f0/0
R2(config-if)# ip address 1.1.123.2 255.255.255.0
R2(config-if)# no shut
R2(config-if)# exit

R2(config)# interface f0/1
R2(config-if)# ip address 1.1.24.2 255.255.255.0
R2(config-if)# no shut
```

```
R3(config)# interface f0/0
R3(config-if)# ip address 1.1.123.3 255.255.255.0
R3(config-if)# no shut
R3(config-if)# exit

R3(config)# interface s1/1
R3(config-if)# ip address 1.1.34.3 255.255.255.0
R3(config-if)# exit
```

```
R4(config)# interface f0/0
R4(config-if)# ip address 1.1.40.4 255.255.255.0
R4(config-if)# no shut
R4(config-if)# exit

R4(config-if)# interface s1/1
R4(config-if)# ip address 1.1.34.4 255.255.255.0
R4(config-if)# no shut
```

R1의 라우팅 테이블
{: .notice}
```

```
---
### OSPF 기본 설정
---
```
R1(config)# router ospf 1
R1(config-router)# router-id 1.1.1.1
R1(config-router)# network 1.1.10.1 0.0.0.0 area 0
R1(config-range)# network 1.1.123.1 0.0.0.0 area 0
```
* router ospf: pid를 입력하여 ospf 설정을 한다
* router-id: 라우터 ID를 지정한다
	* OSPF가 라우터 정보를 전송할때 사용한다
* network: OSPF에 포함 시킬 인터페이스 주소 와일드 카드 및 area 번호를 입력한다
{: .notice}


```
R2(config)# router ospf 1
R2(config-router)# router-id 1.1.2.2
R2(config-router)# network 1.1.123.2 0.0.0.0 area 0
R2(config-router)# network 1.1.24.2 0.0.0.0 area 1
```
```
R3(config)# router ospf 1
R3(config-router)# router-id 1.1.3.3
R3(config-router)# network 1.1.123.3 0.0.0.0 area 0
R3(config-router)# network 1.1.34.3 0.0.0.0 area 1
```
```
R4(config)# router ospf 1
R4(config-router)# router-id 1.1.4.4
R4(config-router)# network 1.1.24.4 0.0.0.0 area 1
R4(config-router)# network 1.1.34.4 0.0.0.0 area 1
R4(config-router)# network 1.1.40.4 0.0.0.0 area 1
```

* OSPF를 통해 전송받은 정보 중 다른 area에 소속된 네트워크 앞에는 IA O 가 붙는다
* 같은 area에 속한 네트워크 앞에는 O 가 표시된다.
{: .notice}

R1의 라우팅 테이블
{: .notice}
```

```

R2의 라우팅 테이블
{: .notice}
```

```

---
### OSPF neighbor
---

* OSPF는 Hello 패킷을 이용하여 인접한 라우터와 neighbor 관계를 형성한다
* Hello 패킷은 네트워크 종류에 따라서 10초 또는 30초 마다 전송된다
* 그리고 4번 연속해서 실패할 경우 neighbor 관계를 해제 한다
	* 데드주기 = Hello패킷 interval * 4 
* 인접 라우터에게서 Hello 패킷을 수신했을때, Hello 패킷에 포함된 neighbor 리스트에 자신의 라우터 ID가 포함 되어있다면 neighbor로 간주한다
* 이때, Hello 패킷에 기록된 에어리어 ID, 암호, 서브넷 마스크 길이, Hello/데드 주기, 스텁 에어리어 표시가 서로 동일해야한다
* OSPF Hello의 목적지 주소는 244.0.0.5로 고정이다 (이더넷과 P to P 에서) 
{: .notice}

R2의 OSPF neighbor 확인하기
{: .notice}
```

```
* 상태가 FULL인 것은 neighbor와 라우팅 정보 교환이 끝났음을 의미한다
* OSPF에서는 트래픽 발생을 줄이기 위해서 라우팅 정보를 하나의 대표라우터에게만 보내고 나머지 라우터가 중계한다
* DR: 중계 역하을 하는 라우터
* BDR: DR에 장애 발생시 대신 DR역할을 해주는 라우터
* DROTHER: DR도 BDR도 아닌것
* 우선순위가 높거나 라우터 ID가 높은 것이 DR이 되고 그 다음이 BDR이 된다
* EIGRP에서는 모든 neighbor 간에 라우팅 정보를 교환했지만 OSPF는 라우팅 정보를 교환하는 adjacent neighbor가 있다
	* DROTHER 끼리는 adjacent neighbor가 되지 못한다
{: .notice}

---
### OSPF 상태변화
---

* Down
* 네이버에서 Hello 패킷을 받지 못한 상태
{: .notice}

* Init
* 나는 Hello 패킷을 받았지만 상대는 나의 Hello 패킷을 못받은 상태
* 상대의 Hello 패킷 내에 있는 네이버 리스트에 나의 라우터 ID가 없을 때
{: .notice}

* Two-way
* 쌍방향 통신이 이루어 졌을 때
* 상대의 Hello 패킷 내에도 나의 라우터 ID가 있다
* 이 단계에서 DR과 BDR을 선출 한다
* 처음 연결시 공정한 선출을 위해 Wait time을 준다 (dead 주기와 같다)
{: .notice}

* Exstart
* adjacent neighbor가 되는 단계다
* master와 slave를 선출한다
{: .notice}

* Exchange
* OSPF 라우팅 정보를 LSA라고 한다
* 링크 상태 데이터 베이스에 이 LSA가 저장되는데 , OSPF가 알고있는 모든 네트워크 정보가 여기 저장된다
* Exchange 상태에서는 LSA의 헤더만을 DDP 또는 DBD라고 부르는 패킷에 담아 상대에게 전송한다
{: .notice}

* Loading
* 상대로부터 DDP 패킷 수신이 끝난 후, 자신에게 없는 정보가 있으면 링크 상태 요청 패킷을 보내어
특정 LSA의 상세 정보를 보내 줄 것을 요청한다
{: .notice}

* Full
* adjacent router 사이의 정보교환이 끝난 상태 adjacent router들이 가진 정보와
 링크 상태 데이터베이스의 내용이 모두 일치하게 된다
{: .notice}

OSPF는 neighbor router와 LSA 교환을 끝낸 다음 5초 기다린 후 라우팅 알고리즘 계산을 하고 
그 결과를 라우팅 테이블에 기록한다. 이때, 최적의 경로 계산을 위해서 사용하는 알고리즘을 SPF 또는
다익스트라 알고리즘이라고 한다
{: .notice}

* OSPF의 상태 메트릭
* OSPF의 메트릭을 cost라고 부른다
* 출발지부터 목적지까지의 각 인터페이스에서 reference bandwidth를 실제 대역폭으로 나눈 값의 합계
* 시스코 IOS의 OSPF 기준 대역폭은 10의 8승이다 (EIGRP는 10의 10승)
* 메트릭값은 각각 경로에 해당하는 cost를 더한 값이다 
{: .notice}

---
### OSPF 네트워크 조정
---

Hello Packet의 Interval을 변경해보자
{: .notice}

```
R1(config)# interface f0/0
R1(config-if)# ip ospf hello-interval 5
```
```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int fa 0/0
R1(config-if)#ip ospf hello-interval 5
R1(config-if)#
Dead time도 짧아 지고 결국 123.1 은 사라진다
Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.123.1         1   FULL/DROTHER    00:00:11    1.1.123.1       FastEthernet0/0
3.3.3.3           1   FULL/DR         00:00:30    1.1.123.3       FastEthernet0/0
4.4.4.4           0   FULL/  -        00:00:32    1.1.24.4        Serial0/1
```
```
R2#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
3.3.3.3           1   FULL/DR         00:00:32    1.1.123.3       FastEthernet0/0
4.4.4.4           0   FULL/  -        00:00:32    1.1.24.4        Serial0/1
R2#

R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#int fa 0/0
R2(config-if)#ip ospf hello-interval 5
R2(config-if)#
```
```
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int fa 0/0
R3(config-if)#ip ospf hello-interval 5
```
```
R2(config-if)#do show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.123.1         1   FULL/DROTHER    00:00:18    1.1.123.1       FastEthernet0/0
3.3.3.3           1   FULL/DR         00:00:17    1.1.123.3       FastEthernet0/0
4.4.4.4           0   FULL/  -        00:00:30    1.1.24.4        Serial0/1
```

* R1 R2 R3의 설정을 바꾸고 나면 Dead interval도 5*4인 20 초 대로 줄어들게 된다
* ip ospf dead-interval 로도 바꿀수 있다
{: .notice}

---
### OSPF 라우팅 보안
---
* OSPF도 다른 라우팅 프로토콜과 마찬가지로 패킷 인증 기능을 이용할 수 있다
* OSPF는 다른 라우팅 프로토콜과는 다르게 특정 area 전체를 인증 할 수 있다
* MD5와 평문 암호 교환을 지원한다(평문 암호는 잘 사용하지 않는다)
{: .notice}

area의 MD5 인증
{: .notice}
```
R1(config)# router ospf 1
R1(config-router)# area 0 authentication message-digest
R1(config-router)# exit
R1(config)# interface f0/0
R1(config-if)# ip ospf message-digest-key 1 md5 cisco
```
OSPF MD5 인증
{: .notice}
```
R2(config)# interface s1/0.24
R2(config-subif)# ip ospf authentication message-digest
R2(config-subif)# ip ospf message-digest-key 1 md5 cisco
```

* 종단 부분에 Passive interface 설정
* neighbor를 맺지 못하도록 막는다(Hello Packet을 받지 못하도록한다)
* 변조된 braodcast를 막을 수 있다
{: .notice}

```
R1(config)# router ospf 1
R1(config-range)# passive-interface f0/1 
R4(config)# router ospf 1
R4(config-range)# passive-interface f0/1
```

* OSPF Default route 설정
* Defualt로 설정할 route를 정적으로 설정하고나서 디폴트 루트를 광고하도록 설정 할 수 있다
{: .notice}
```
R2(config)#router ospf 1
R2(config-router)#default-information originate

R4(config-router)#do show ip route | begin Gate
Gateway of last resort is 1.1.34.3 to network 0.0.0.0

     1.0.0.0/24 is subnetted, 5 subnets
O IA    1.1.10.0 [110/66] via 1.1.34.3, 00:21:31, Serial0/0
                 [110/66] via 1.1.24.2, 00:21:41, Serial0/1
C       1.1.24.0 is directly connected, Serial0/1
C       1.1.34.0 is directly connected, Serial0/0
C       1.1.40.0 is directly connected, FastEthernet0/0
O IA    1.1.123.0 [110/65] via 1.1.34.3, 00:26:15, Serial0/0
                  [110/65] via 1.1.24.2, 00:26:15, Serial0/1
O*E2 0.0.0.0/0 [110/1] via 1.1.34.3, 00:00:02, Serial0/0
               [110/1] via 1.1.24.2, 00:00:02, Serial0/1
```