---
title: "Network: NAT"
last_modified_at: 2020-08-17T20:20:02-05:00
categories:
  - Network
tags:
  - NAT
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### NAT 개념
---

**NAT(network address translation)는** 외부와 라우팅이 불가능한 사설 IP주소를 
공인 IP 주소로 변환하여 외부와 통신이 가능하게 만들거나, 조직 내부의 주소가 
외부로 공개되지 않도록 하여 보안을 강화하기 위한 목적으로 만들어졌다. 
NAT는 IP 패킷의 출발지 또는 목적지 IP 주소를 다른 IP 주소로 변환할 수 있으며, 
설정에 따라 전송 계층의 TCP/UDP 포트 변호도 변환할 수 있다. 
{: .notice}--info

공인 IP가 부족할 경우 포트번호도 변환하여 사용하는 것 -> PAT
{: .notice}

* 목적
* 경계 라우터에서 NAT 기능을 설정
* 외부에 알려줄 IP가 변경되었을 때, 내부망 모든 장비의 IP 주소를 변경하려면 상당한 시간이 소요되기 때문에 NAT 설정만으로 변경된 IP를 통해 통신할 수 있게한다.
* 보안의 목적으로 주소 변환 기능을 사용하면 내부 IP 주소가 외부에 알려지지 않기 때문에, 외부로부터 직접적인 공격을 막을 수 있다. 
{: .notice--info}

* 유형
* NAT 설정은 다음의 두 가지 유형이 가능하다. 하나는 도메인 기반의 NAT이고,
* 다른 하나는 NVI(NAT Virtual Interface) 기반의 NAT이다.
* 도메인 기반의 NAT 설정에서는 NAT 장비를 기준으로 inside, outside 도메인이 존재해야만 주소 변환이 동작한다. Local Address는 컴퓨터가 직접 사용하는 주소다(내부망에서 사용하는 주소, 보통은 사설 아주 가끔 공인을 사용한다), Global address는 인터넷으로 내보내기 위한 주소 (반드시 공인 IP 주소)
	* Inside local: 내부망 안에서 사용
	* Inside Global: (같은 내부망의 호스트) local 주소 대신 외부로 나가는 주소 = 출발지
	* Outside Local: 다른 도메인 호스트의 외부로 나가는 주소 = 도착지
	* Outside Global: 다른 도메인 호스트가 사용하는 공인 주소
	* NAT를 사용하지x Outside Local = Outside Global(공인 주소 사용) 경우도 있다
{: .notice--warning}

그렇다면 Ping을 한다고 가정했을 때, 패킷 모양은 다음과 같다.
{: .notice}

```
출발지: 192.168.100.5
목적지:192.168.200.10
ICMP
```

목적지로는 Outside Local 주소를 사용한다. 이러한 패킷이 라우터를 통해 나간다고 가정하자. 
패킷의 모양은 되돌아올 수 있도록 출발지도 공인으로 도착지도 잘 찾아가도록 공인 ip로 바뀌어야한다.
{: .notice}

```
출발지: 7.7.7.7
도착지: 8.8.8.10
ICMP
```

이 패킷이 도착지 쪽 라우터로 갔을 때 다시 도착 주소가 변환되어야 한다.
{: .notice}

정리 하면 출발지를 기준으로 봤을 때 내부에서는 inside local로 출발하여 라우터를 통해 inside Global 로 변환됨. 
도착지 주소의 경우 outside local에서 outside global로 변환되었다가 도착지 서브넷으로 들어가는 라우터에서(nat 설정이 된곳) outside local 로 다시 변환된다. (또는 NAT를 사용하지 않는 호스트의 경우 같은 주소를 사용하기도 함)
{: .notice}


* NAT를 사용하기 위해서는 라우터에 주소를 알아보고 변환할 수 있도록 정책이 필요하다.
* 사설 IP 대역: 192.168.100.0/24 (ACL을 통해 지정)
* 공인 IP 대역: 7.7.7.1 ~ 7.7.7.100 (IP NAT POOL)
* 사설 ip 대역과 공인 IP 대역 매핑(IP NAT INSIDE)
{: .notice}

```
Ip access-list standard Private
Permit 19.168.100.5 ~
Ip nat pool Public 7.7.7.7 ~
Ip nat inside source ~
```

Inside 가 출발지 -> local 서브넷 안, global 서브넷 밖   
Outside 가 도착지 -> local 서브넷 안, global 서브넷 밖  
{: .notice}

* 동작 순서
* R1 왼쪽에서 들어올 수 있는 주소인지 ACL 에서 먼저 검사하고 그 후에 NAT 처리 해서 내보낸다. 
* 패킷의 출발지와 연결된 인터폐이스에 Inbound ACL이 설정되어 있다면, 해당ACL을 먼저 체크한다.
* 체크가 끝났다면 폴리시 라우팅(Policy-routing) 대상 패컷인지 확인한다. (정책적 라우팅)
	* Longest match rule -> AD -> metric 순서로 본다.
* 라우팅 태이블을 참조하여 출구 인터페이스를 찾는다.(normal routing)
* NAT 정책에 부합하는지 확인하여 주소 변환을 실시한다.
* CBAC이 설정되어 있다면 CBAC의 검사(Inspect)를 수행한다.
* 출구 인터페이스에 적용되어 있는 Outbound ACL 체크를 마지막으로 패킷은 주소를 변환한 채 목적지를 향해 전송된다. 
{: .notice--info}

역방향의 경우 위의 과정은 거꾸로 진행한다.
{: .notice--warning}

* 최적의 경로 선출기준
* Longest Match Rule
* AD(Adminitrative Distance)
	* 0 - Directly Connected
	* 1 - Static Route
	* 90 - EIGRP
	* 110 - OSPF
	* 120 - RIP
* Metric
{: .notice--info}

* 정적 NAT (1:1)
	* 사설 IP와 공인 IP 매핑 한다
* 동적 NAT(N:N)
	* 사설 IP 대역
	* 공인 IP 대역
* 사설 IP와 공인 IP 대역 매핑
	* 정적 PAT(1:1)
	* 동적 PAT(N:1) 
{: .notice}


---
### 토폴로지 설정
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/nat1.JPG" alt="">
  <figcaption> </figcaption>
</figure>

```
conf t 
int fa 0/1
ip add 10.1.1.1 255.255.255.0
no shut
int fa 0/0
ip add 10.1.100.1 255.255.255.0
no shut

conf t 
int fa 0/1
ip add 10.1.2.2 255.255.255.0
no shut
int fa 0/0
ip add 10.1.100.2 255.255.255.0
no shut

conf t 
int fa 0/0
ip add 10.1.100.3 255.255.255.0
no shut
int fa 0/1
ip add 1.1.34.3 255.255.255.0
no shut
int lo0
ip add 10.1.3.3 255.255.255.0
no shut

conf t
int fa 0/0
ip add 1.1.34.4 255.255.255.0
no shut
int fa 0/1
ip add 1.1.4.4 255.255.255.0
no shut
```

라우팅 테이블은 돌리면 안된다. 외부 망 까지 광고 해서 다 라우팅 테이블에 기록되어서 
굳이 하자면 ospf를 사용할 네트워크만 지정해서 만들어준다. 
외부망인 1.1.34.0 대역대는 하지 않는다. 
{: .notice}

```
#R3
conf t
ip route 0.0.0.0 0.0.0.0 1.1.34.4

router ospf 1
router-id 3.3.3.3
network 10.1.3.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
default-information originate
end

#R1
conf t
router ospf 1
router-id 1.1.1.1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
end

#R2
conf t
router ospf 1
router-id 2.2.2.2
network 10.1.2.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
end
```

default-information originate 는 ospf 에서 자신을 디폴트 게이트웨이로 설정함
{: .notice}

설정이 잘되었는지 ping을 통해 확인해보자.
{: .notice}

```
R3#ping 10.1.1.1 source 10.1.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
Packet sent with a source address of 10.1.3.3
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/28/36 ms

R1#ping 1.1.34.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.34.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/28/32 ms
R1#

R2#ping 1.1.34.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.34.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 32/37/44 ms
```

R4 까지는 아직 닿을 수 없다. NAT 처리가 안되어서.
{: .notice}

R4가 공인 ip 대역대를 isp 로부터 구매했다고 가정하면, ISP에서는 다음과 같이 정적 경로를 설정한다.
{: .notice}

```
#R4
conf t
ip route 2.2.2.0 255.255.255.0 1.1.34.3	//ISP가 정적 경로부터 설정
end
copy r s
```


---
### 정적 NAT 실습
---
```
#R3
show ip nat translation
conf t
ip nat inside source static 10.1.100.1 2.2.2.200	
//출발지 주소가 100.1인 패킷은 2.200 으로 변환 하여 외부로 전송하도록
```

int fa 0/0  
ip nat inside  //해당 인터페이스를 inside 도메인으로  
{: .notice}

int fa 0/1  
ip nat outside // 해당 인터페이스를 outside 도메인으로  
{: .notice}

변환된 nat 정보를 살펴보자
{: .notice}

```
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
--- 2.2.2.200          10.1.100.1         ---                ---
R3(config-if)#
```


R1 에서 ping 한 후 에 다시 보자
{: .notice}

```
R1#ping 1.1.4.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 32/57/72 ms
R1#
```

주소가 추가됨을 볼 수 있다.
{: .notice}

```
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
icmp 2.2.2.200:2       10.1.100.1:2       1.1.4.4:2          1.1.4.4:2
--- 2.2.2.200          10.1.100.1         ---                ---
R3(config-if)#
```

R1 에서 4로 telnet 접속을 해보면 접속가능하다.
{: .notice}

```
R1#telnet 1.1.4.4
Trying 1.1.4.4 ... Open


User Access Verification
```

R4에 접속한 유저를 조회 해보자.
{: .notice}
```
R4#
*Mar  1 00:49:36.371: %SYS-5-CONFIG_I: Configured from console by console
R4#show users
    Line       User       Host(s)              Idle       Location
*  0 con 0                idle                 00:00:00
 162 vty 0                idle                 00:00:08 2.2.2.200
```

R4에서 2.2.2.200으로 접속하면 R1으로 접속된다. 정적 NAT는 항상 NAT 테이블을 만들어 놓아서 다른 NAT와 달라 외부로부터의 접속을 막지 않아서 가능하다.   
== 같은말   
정적 NAT의 경우 NAT 테이블에 주소 변환 정보가 반영구적으로 존재하므로, 외부에서 먼저 세션을 시작하여도 주소 변환이 동작한다. 즉, 외부에서 Inside global 주소를 목적지로 하여 접근할 경우, 해당 패컷의 목적지 주소를 Inside local 주소로 변환시킨다.  
{: .notice}


```
R4#telnet 2.2.2.200
Trying 2.2.2.200 ... Open
User Access Verification
Password:
R1>
```

R4에서 2.2.2.200 주소로 telnet 후 R3 nat 변환 정보를 살펴보면 다음과 같이 추가됨을 볼 수 있다.
{: .notice}

```
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.200:23       10.1.100.1:23      1.1.34.4:59842     1.1.34.4:59842
tcp 2.2.2.200:51948    10.1.100.1:51948   1.1.4.4:23         1.1.4.4:23
--- 2.2.2.200          10.1.100.1         ---                ---
R3(config-if)#
```

```
R3#show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.200:23       10.1.100.1:23      1.1.34.4:59842     1.1.34.4:59842
--- 2.2.2.200          10.1.100.1         ---                ---
```

통계 정보를 보여준다.
{: .notice}

```
R3#show ip nat statistics
Total active translations: 2 (1 static, 1 dynamic; 1 extended)
Outside interfaces:
  FastEthernet0/1
Inside interfaces:
  FastEthernet0/0
Hits: 82  Misses: 0
CEF Translated packets: 82, CEF Punted packets: 0
Expired translations: 2
Dynamic mappings:
Appl doors: 0
Normal doors: 0
Queued Packets: 0
R3#
```

외부(outside)의 출발지 주소가 1.1.4.4인 패킷은 5.5.5.5로 변환하여 내부{inside) 로 전송하겠다는 정적인 NAT 정잭을 설정한다. 설정 후 R3에서 NAT 테이블을 확인하면 outside에 대한 주소 변환 정잭이 새로 등록된 것을 알 수 있다.
{: .notice}

```
#R3
conf t
ip nat outside source static 1.1.4.4 5.5.5.5

R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
--- ---                ---                5.5.5.5            1.1.4.4
tcp 2.2.2.200:23       10.1.100.1:23      1.1.34.4:52068     1.1.34.4:52068
--- 2.2.2.200          10.1.100.1         ---                ---
R3(config)#
```
```
R1#telnet 5.5.5.5
Trying 5.5.5.5 ... Open


User Access Verification

Password:
R4>
```

새로운 변환정책을 이용한 nat 변환 정보가 추가되었다.
{: .notice}

```
R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
--- ---                ---                5.5.5.5            1.1.4.4
tcp 2.2.2.200:23       10.1.100.1:23      1.1.34.4:59236     1.1.34.4:59236
tcp 2.2.2.200:21318    10.1.100.1:21318   5.5.5.5:23         1.1.4.4:23
--- 2.2.2.200          10.1.100.1         ---                ---
R3(config)#
```

---
### 동적 NAT 실습
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/nat1.JPG" alt="">
  <figcaption> </figcaption>
</figure>

정적 NAT와 같은 토폴로지에서 실습하기위해 초기화를 해준다.
{: .notice}

```
R3(config)#do show run | include nat
 ip nat inside
 ip nat outside
 default-information originate
ip nat inside source static 10.1.100.1 2.2.2.200
ip nat outside source static 1.1.4.4 5.5.5.5
```
```
R3(config)#no ip nat inside source static 10.1.100.1 2.2.2.200
R3(config)#no ip nat outside source static 1.1.4.4 5.5.5.5
R3(config)#do show ip nat translation
```

```
ip access-list standard Private
permit 10.1.1.0 0.0.0.255
permit 10.1.2.0 0.0.0.255
permit 10.1.3.0 0.0.0.255
permit 10.1.100.0 0.0.0.255   처럼 해도된다. 
```
```
ip access-list standard Private
permit 10.0.0.0 0.255.255.255   // 출발지 ip만 신경쓴다
```
```
ip access-list extended Private
permit 10.0.0.0 0.255.255.255 // 출발지 목적지 ip와 포트 다 검사 
//정확하게 세분화 해서 정책을 세울 떄 사용
```

정적 nat의 경우 세분화 해서 할 필요가 없으므로 standard 를 사용
{: .notice}

* 동적 nat 설정 순서!
* 사설 IP 대역 을 우선 ACL로 지정해준다  (이름 Private)
	* Ip access-list standard Private
	* Permit 10.0.0.0 0.255.255.255
* 공인 IP 대역 (IP NAT POOL)  Public 이라는 이름의 pool 생성
	* Ip nat pool Public 2.2.2.1 2.2.2.100 netmask 255.255.255.0
* 매핑과정  ip nat inside source list Private pool Public 내부에서 출발하는 주소들을 매핑시켜줌
{: .notice}

```
conf t
ip access-list standard Private
permit 10.0.0.0 0.255.255.255
exit
```
```
ip nat pool Public 2.2.2.1 2.2.2.100 netmask 255.255.255.0
ip nat inside source list Private pool Public
do show ip nat translation
```

테스트 설정이 잘되었나 확인해보자
{: .notice}

```
R1#ping 1.1.4.4 source 10.1.100.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
Packet sent with a source address of 10.1.100.1
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 32/39/44 ms
R1#ping 1.1.4.4 source 10.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
Packet sent with a source address of 10.1.1.1
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 24/39/48 ms
R1#
```

Translation 확인
{: .notice}

```
R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
icmp 2.2.2.2:4         10.1.1.1:4         1.1.4.4:4          1.1.4.4:4
--- 2.2.2.2            10.1.1.1           ---                ---
icmp 2.2.2.1:3         10.1.100.1:3       1.1.4.4:3          1.1.4.4:3
--- 2.2.2.1            10.1.100.1         ---                ---
R3(config)#
```

이번에 또 다르게 
{: .notice}

```
R2#ping 1.1.4.4 source 10.1.100.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
Packet sent with a source address of 10.1.100.2
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 36/41/44 ms
R2#ping 1.1.4.4 source 10.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
Packet sent with a source address of 10.1.2.2
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 40/44/48 ms
R2#
```

Translation 확인
{: .notice}

```
R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
--- 2.2.2.2            10.1.1.1           ---                ---
icmp 2.2.2.4:2         10.1.2.2:2         1.1.4.4:2          1.1.4.4:2
--- 2.2.2.4            10.1.2.2           ---                ---
--- 2.2.2.1            10.1.100.1         ---                ---
icmp 2.2.2.3:1         10.1.100.2:1       1.1.4.4:1          1.1.4.4:1
--- 2.2.2.3            10.1.100.2         ---                ---
R3(config)#
```