---
title: "Security: ASA 방화벽의 접속과 ACL"
last_modified_at: 2020-08-21T20:20:02-05:00
categories:
  - Security
tags:
  - Firewall
  - ASA
  - ACL
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 방화벽 접속 제어
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_basic3.jpg" alt="">
  <figcaption> </figcaption>
</figure>

방화벽을 제어하기 위하여 콘솔, 텔넷, SSH, ASDM 및 VPN을 통해 방화벽에 접속할 수 있다. 
(콘솔이 유일한 로컬이다)
{: .notice}

---
#### Telnet을 통한 ASA 접속
---

암호가 없으면 원격 접속을 할 수 없다.
{: .notice}

```console
FW1# conf t
FW1(config)# enable password cisco123
FW1(config)# exit
FW1# exit

Logoff

Type help or '?' for a list of available commands.
FW1> enable
Password: ********
FW1#
```

enable password 명령어를 이용하여 enable에 대한 암호를 설정해준다. 
 여기서 말하는 enable은 privilege 모드의 암호를 설정하는 것이고 telnet을 이용하기 위해서는
 User Exec 암호 설정이 필요하다. 그래서 다음과 같이 패스워드를 한번 더 설정한다.
{: .notice}

```console
FW1# conf t
FW1(config)# passwd cisco
```

기본적으로 라우터는 패스워드만 맞으면 모든 장비에서 접속을 할 수 있지만 ASA 장비는 모든 접속을 거부하는 정책을 가져서
사용할 일부분을 허용해줘야한다. 이때 10.10.10.10으로 부터의 접속만 허용하려면 무엇을 해야할까? ACL 설정을 해줘야 한다.
{: .notice}

```console
# ip access-list statndard acl_host
# permit host 10.10.10.10
//acl 생성
# line vty 0 4
# ip access-classs acl_host
//acl 적용
# telnet 10.10.10.0 255.255.255.0 inside
//Telnet 허용
```
* access-list를 통해서 10.10.10.10으로 부터 오는 패킷을 모두 허용한다.
* access-classs를 통해서 더 편리하게 적용할 수 있다. (설정할 값들이 많은 경우)
* 10.10.10.0 대역에서 inside 방향으로의 telnet 접근을 허용한다.
* telnet만 허용할 경우 acl 없이 telnet 10.10.10.0 255.255.255.0 inside만 해주면 된다.
{: .notice}

* enable password cisco123 #enable에 대한 패스워드 설정
* passwd cisco #telnet에 대한 패스워드 설정
* telent x.x.x.x 255.255.255.0 inside #Telent 허용
{: .notice--info}

만약, R2(1.1.20.2) 에서 FW1 outside(1.1.20.10)으로 접속을 시도한다면 어떻게 될까?
{: .notice--warning}

```console
FW1# conf t
FW1(config)# telnet 1.1.20.2 255.255.255.255 outside
FW1(config)# show run telnet
telnet 10.10.10.0 255.255.255.0 inside
telnet 1.1.20.2 255.255.255.255 outside
telnet timeout 5
```

```console
R2#telnet 1.1.20.10
Trying 1.1.20.10 ...
% Connection timed out; remote host not responding
```

보안 레벨이 가장 낮은 인터페이스는 접속을 할 수 없다. outside 가 default 0으로 최저값을 
가지기 때문에 보안 레벨을 일시적으로 올려서 해결 할 수 있다.
{: .notice--warning}

```console
FW1(config)# show run int gi0/0
!
interface GigabitEthernet0/0
 nameif inside
 security-level 100
 ip address 10.1.10.10 255.255.255.0
FW1(config)# show run int gi0/1
!
interface GigabitEthernet0/1
 nameif outside
 security-level 0
 ip address 1.1.20.10 255.255.255.0
```

inside는 100 outside는 0 이 default security-level 이다.
{: .notice--warning}

---
#### SSH를 통한 ASA 접속
---

SSH는 인증 기능을 제공하기 때문에 Telnet과는 다르게 Security-level이 가장 낮은 인터페이스를 통해서도 접속이 가능하다. 
{: .notice--info}

```console
FW1(config)# aaa authentication telnet console ?

configure mode commands/options:
  LOCAL  Predefined server tag for AAA protocol 'local'
  WORD   Name of RADIUS or TACACS+ aaa-server group for administrative
         authentication

FW1(config-if)# username admin password cisco123
FW1(config)# aaa authentication telnet console LOCAL
```
* telnet에도 위와 같이 (aaa authentication) 인증 설정을 할 수있다.
* RADIUS 나 TACACS 는 계정 정보를 가진 서버라고 생각하면 쉽다.
{: .notice}

다시 돌아와서 ssh 접속을 해보자. 아래와 같이 인증 설정과 허용할 ip 대역대를 지정하면 외부에서도 접속이 가능하다.
{: .notice}

```console
FW1(config)# username admin password cisco123
FW1(config)# aaa authentication ssh console LOCAL
FW1(config)# crypto key generate rsa modulus 1024

FW1(config)# ssh 10.10.10.10 255.255.255.255 inside
FW1(config)# ssh 1.1.20.2 255.255.255.255 outside

R2#ssh -l admin 1.1.20.10

Password:
Password:
Type help or '?' for a list of available commands.
FW1>
FW1> exit

R1#ssh -l admin 10.1.10.10
```

---
### 액세스 리스트
---

기존의 라우터에서 했던 설정 방식을 살펴보자
{: .notice}

```console
ip access-group 100 in
ip access-group acl-inside-http in
ip access-group acl-outside-http in

ip access-list extended acl-inside-http
permit ip host 1.1.1.1 any
```

asa 장비에서는 interface 이름 대신에 nameif outside, inside와 같이 이름을 사용한다.
{: .notice}

```console
permit ip any host 1.1.20.1
permit ip any host server_mail eq 25 //이렇게 말이다.
```

* 방화벽의 액세스리스트와 라우터의 ACL은 비슷하다.
* 기본적으로 ACL 설정에 따라 트래픽의 L2/L3/L4 정보를 분석하여 차단, 허용하는 용도로 사용한다.
* 또한, NAT VPN 루트맵 설정에서 IP 주소를 지정하기 위한 용도로도 사용한다.
{: .notice}

* 표준 액세스 리스트
	* 라우터와 마찬가지로 목적지 IP주소를 기반으로 패킷을 식별한다.
	* 트래픽 필터링을 위해 인터페이스에 적용할 수 없다.
	* OSPF 재분배를 위한 루트맵, 리모트 액세스 VPN 설정에만 사용된다.
	* 라우터 모드에서만 사용할 수 있다.
* 확장 액세스 리스트
	* 방화벽에서 가장 많이 사용하는 액세스 리스트
	* 출발지/목적지 IP, 프로토콜 종류, 출발지/목적지 포트 번호로 트래픽 제어
	* AAA 정책, VPN, NAT 설정 등 다양한 곳에서 사용
	* 라우터, 트랜스패런트 모드 둘다 사용 가능하다.
* 이더타입 액세스 리스트
	* 이더 타입 (이더넷 ID, 타입 번호)
	* 트랜스패런트 모드에서 사용하는 ACL로 L2 헤더를 이용하여 트래픽을 제어한다.
	* IPX, BPDU, MPLS 패킷 같은 IP 기반 프로토콜들을 제어 할 수 있다.
* IPv6 액세스 리스트
	* IPv6 트래픽 제어
* 웹 타입 액세스 리스트
	* 클라이언트리스 SSL VPN의 트래픽을 제어하기 위하여 사용한다.
{: .notice--info}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_acl1.jpg" alt="">
  <figcaption> </figcaption>
</figure>

이더넷 프레임을 보자 Destination Address와 Source Address 뒤에 Type으로 이더 타입을 알 수 있다.
{: .notice}

---
### 확장 ACL 실습1
---
<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_basic4.jpg" alt="">
  <figcaption> </figcaption>
</figure>

확장 ACL은 출발지/목적지 IP, 프로토콜 번호 혹은 이름을 이용하여 트래픽을 제어한다.
 또는 출발지/목적지 포트 번호나 이름으로 트래픽을 제어할 수도 있다.
{: .notice}

먼저, R1에 http 접속을 할 수 있도록 http server를 활성화 하고 telnet 접속을 위해 패스워드 설정을 해준다.
{: .notice}

```console
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip http server
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#end
```

R2에서 R1으로 ping, telnet, http(telnet 80) 접속을 시도하면 안될 것이다. ACL를 설정해보자.
{: .notice}

```console
R1(10.10.10.1) <– inside-FW1-outside <- R2(1.1.2.2)
		http(www, 80)

R1(10.10.10.1) <– inside-FW1-outside <- R2(1.1.2.0)
		icmp
```

```console
FW1(config)# access-list OUTSIDE-IN extended permit tcp host 1.1.2.2 host 10.10.10.1 eq www
FW1(config)# access-list OUTSIDE-IN extended permit icmp 1.1.2.0 255.255.255.0 host 10.10.10.1
FW1(config)# access-group OUTSIDE-IN in interface outside
```

OUTSIDE-IN 이라는 이름으로 1.1.2.2 에서 10.10.10.1 포트번호 80(www)으로 접근 할 수있도록 허용했다.
 그리고 1.1.2.0 대역대에서 호스트 10.10.10.1로 icmp 패킷을 보낼 수 있도록 허용하였다.
{: .notice}

```console
R2#ping 10.10.10.1 source 1.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.10.1, timeout is 2 seconds:
Packet sent with a source address of 1.1.2.2
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/33/44 ms
```

R2에서 source를 1.1.2.2로 고정하고 10.10.10.1로 ping을 보냈더니 잘 도달한다.
 1.1.2.2에서 10.10.10.1로 icmp reply가 잘 도달 할 수있도록 acl을 통해 permit 해주었기 때문에 가능하다.
{: .notice}

---
### 확장 ACL 옵션
---

IP 헤더 프로토콜 필드의 번호나 이름 지정하기
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN extended permit ?

configure mode commands/options:
<0-255>		Enter protocol number (0 - 255)
ah
eigrp
esp
grp
icmp
icmp6
igmp
igrp
ip
...

```

포트 번호 지정 옵션
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN extended permit tcp host 1.1.2.2 host 1.1.1.1 ?

configure mode commands/options:
eq	Port equal to operator //특정한 포트 번호 하나만 지정한다.
gt	Port greater than operator //특정 번호보다 큰 포트 번호들을 지정한다.
inative	keyword for disabling an ACL element
log	keyword for enabling log option on this ACL element
lt	Port less than operator //특정 번호보다 작은 포트 번호들을 지정한다.
neq	Port not equal to operator
range Port range operator //Port range operator
time-range	Keyword for attaching time-range option to this ACL element
<cr>
```

ACL 적용하는 법은 다음과 같다
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN extended permit tcp host 1.1.2.2 host 10.10.10.1 eq www
FW1(config)# access-list OUTSIDE-IN extended permit icmp 1.1.2.0 255.255.255.0 host 10.10.10.1
FW1(config)# access-group OUTSIDE-IN in interface outside
```

실질 적으로 acl을 적용하는 명령은 access-group OUTSIDE-IN in interface outside 이다. 좀 더 살펴보자.
{: .notice}

```console
FW1(config)# access-gorup OUTSIDE-IN in interface outside
//전체 설정 모드에서 access-group 명령어를 사용한다.
//in 또는 out 그리고 global 옵션을 사용하여 적용 방향을 지정한다.
//interface 옵션을 이용하여 인터페이스의 이름을 지정
```

---
### 확장 ACL 실습2
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_basic4.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```console
R1#telnet 1.1.20.2
Trying 1.1.20.2 ... Open

User Access Verification

Password:
```

```console
R1#ping 1.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.2.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

```console
R2#ping 10.1.10.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

```console
R2#ping 10.10.10.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.10.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

* R1에서 1.1.20.2와 1.1.2.2 로 ping 불가
* R2에서 10.1.10.1과 10.1.10.1로 ping 불가
{: .notice--warning}

FW1에 ACL을 적용한 후 어떻게 동작하는지 살펴보자
{: .notice--warning}

```console
FW1(config)# access-group OUTSIDE-IN in interface outside
```

```console
R2#ping 10.10.10.1 source 1.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.10.1, timeout is 2 seconds:
Packet sent with a source address of 1.1.2.2
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/24/32 ms
```

acl의 permit icmp 1.1.2.0 255.255.255.0 host 10.10.10.1가 적용되면서 ping이 가능해진다.
{: .notice--warning}

```console
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip http server
R1(config)#line vty 0 3
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#end
```

```console
R2#telnet 10.10.10.1 80 /source-inter loop0 #정확하게 루프백이어야 하고 포트번호 주소 다 일치해야한다
Trying 10.10.10.1, 80 ... Open
quit
HTTP/1.1 400 Bad Request
Date: Fri, 01 Mar 2002 04:24:41 GMT
Server: cisco-IOS
Accept-Ranges: none

400 Bad Request

[Connection to 10.10.10.1 closed by foreign host]
```

acl의 permit tcp host 1.1.2.2 host 10.10.10.1 eq www이 적용되면서 http도 접속이 가능해진다.  
단, 정확한 출발지 interface와 주소, 포트번호를 입력해야한다.
{: .notice--warning}

아래의 경우도 살펴보자 우선 아무런 옵션 없이 1.1.20.2와 1.1.2.2로 ping 해보았다.
{: .notice--warning}

```console
R1#ping 1.1.20.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.20.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```
```console
R1#ping 1.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.2.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

source 옵션을 이용하여 10.10.10.1 로 출발지를 지정해주었더니 ping이 잘된다.
 그냥 ping을 보내게 되면 도착지와 가까운 10.1.10.1에서 메세지를 전송하게되는데 acl을 통해 host 10.10.10.1만 허용해주었으므로
 따로 source를 지정해주어야 잘 동작한다.
{: .notice--warning}

```console
R1#ping 1.1.2.2 source 10.10.10.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.2.2, timeout is 2 seconds:
Packet sent with a source address of 10.10.10.1
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/32/44 ms
```

---
### ACL 추가 및 제거
---

```console
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 extended permit tcp host 1.1.2.2 host 10.10.10.1 eq www (hitcnt=1) 0xcf0e320d
access-list OUTSIDE-IN line 2 extended permit icmp 1.1.2.0 255.255.255.0 host 10.10.10.1 (hitcnt=24) 0xf7dafeea
```
위와 같은 acl이 있다고 하자. rule 마다 번호가 지정이 되어있는데 원하는 위치에 rule을 추가 할 수 있다.
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN line 2 deny icmp any any echo-reply
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
access-list OUTSIDE-IN; 3 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 extended permit tcp host 1.1.2.2 host 10.10.10.1 eq www (hitcnt=1) 0xcf0e320d
access-list OUTSIDE-IN line 2 extended deny icmp any any echo-reply (hitcnt=0) 0x7bf508d7
access-list OUTSIDE-IN line 3 extended permit icmp 1.1.2.0 255.255.255.0 host 10.10.10.1 (hitcnt=24) 0xf7dafeea
FW1(config)#
```

line 2 를 명시하여 2번 위치에 icmp reply를 막는 rule을 추가하였다.
{: .notice}

```console
FW1(config)# clear configure access-list OUTSIDE-IN
```

위 명령어를 통해 OUTSIDE-IN에 대한 acl만 지울 수 있다. 
이때, 그냥 clear configure access-list를 입력하면 모든 acl이 지워진다.
{: .notice}


---
### 확장 ACL의 로그 생성 및 해석
---

```
FW1> enable
Password:
FW1# conf t
FW1(config)# access-list OUTSIDE-IN remark Testing no log option
FW1(config)# access-list OUTSIDE-IN permit ip host 1.1.2.2 any
FW1(config)# access-list OUTSIDE-IN deny ip host 1.1.20.2 any
FW1(config)#
FW1(config)# access-group OUTSIDE-IN in interface outside
```

remark를 통해 설명을 추가해놓을 수 있다.
{: .notice}

```
R2#ping 10.1.10.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```
```
R2#ping 10.1.10.1 source 1.1.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
Packet sent with a source address of 1.1.2.2
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/25/40 ms
```

1.1.2.2를 source로 지정해주어야 ping이 성공한다.
{: .notice}

```
R2#telnet 10.1.10.1
Trying 10.1.10.1 ...
% Connection timed out; remote host not responding

R2#telnet 10.1.10.1 /source-interface loop 0
Trying 10.1.10.1 ... Open
User Access Verification
Password:
```

telnet도 source 인터페이스를 loop0 로 설정해주어야 10.1.10.1로 telnet이 가능하다.
{: .notice}

중요한 것은 다음을 주목해보자. ping을 보내면 해당 조건과 부합하는 acl rule의 hit count 가 증가한다.
{: .notice--warning}

```
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 remark Testing no log option
access-list OUTSIDE-IN line 2 extended permit ip host 1.1.2.2 any (hitcnt=7) 0x82f498fb
access-list OUTSIDE-IN line 3 extended deny ip host 1.1.20.2 any (hitcnt=7) 0x7acba488
```
```
R2#ping 10.1.10.1 repeat 2

Type escape sequence to abort.
Sending 2, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
..
Success rate is 0 percent (0/2)
```
```
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 remark Testing no log option
access-list OUTSIDE-IN line 2 extended permit ip host 1.1.2.2 any (hitcnt=7) 0x82f498fb
access-list OUTSIDE-IN line 3 extended deny ip host 1.1.20.2 any (hitcnt=9) 0x7acba488
//hit count가 2개가 올라갔다.
```

3번째 rule의 (hitcnt=7)이 (hitcnt=9)로 올라갔다. 이를 Optical Character Reader (OCR): 문자(메시지) 생성 과정 이라고 부른다.
{: .notice--warning}

logging 기능을 활성화 하고 다시 실행하면 어떻게 될까?
{: .notice--warning}

```
FW1(config)# logging enable
FW1(config)# logging console 7
```
```
//Ping 시도
R2#ping 10.1.10.1 repeat 3

Type escape sequence to abort.
Sending 3, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
...
Success rate is 0 percent (0/3)
R2#ping 10.1.10.1 repeat 3

Type escape sequence to abort.
Sending 3, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
...
Success rate is 0 percent (0/3)
```
```
//결과 로그 화면
FW1(config)# %ASA-5-111008: User 'enable_15' executed the 'logging console 7' command.
%ASA-5-111010: User 'enable_15', running 'CLI' from IP 0.0.0.0, executed 'logging console 7'
%ASA-4-106023: Deny icmp src outside:1.1.20.2 dst inside:10.1.10.1 (type 8, code 0) by access-group "OUTSIDE-IN" [0x7acba488, 0x0]
%ASA-4-106023: Deny icmp src outside:1.1.20.2 dst inside:10.1.10.1 (type 8, code 0) by access-group "OUTSIDE-IN" [0x7acba488, 0x0]
%ASA-4-106023: Deny icmp src outside:1.1.20.2 dst inside:10.1.10.1 (type 8, code 0) by access-group "OUTSIDE-IN" [0x7acba488, 0x0]
```

위 처럼 실시간으로 로그가 발생하게 된다.
{: .notice--warning}

---
### 차단 플로우 관리
---

* log 옵션을 사용하여 106100 메세지 로깅을 활성화 시키면 패킷이 특정 ACE에 해당될때 새로운 플로우 엔트리를 생성하여 
생성된 기간 동안 패킷 수를 추적한다. 
* ASA는 최대 32K 로깅 플로우를 가진다.
* 메모리와 CPU가 무제한으로 할당되는 것을 방지하기 위하여 동시 차단 플로우의 수를 제한 할 수 있다.
* 제한된 최대치에 도달하면 기존의 플로우가 만료될떄 까지 새로운 로깅 플로우를 만들지 않는다.
{: .notice}

우선 기존에 설정되었던 acl를 살펴보자.
{: .notice}

```
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 remark Testing no log option
access-list OUTSIDE-IN line 2 extended permit ip host 1.1.2.2 any (hitcnt=7) 0x82f498fb
access-list OUTSIDE-IN line 3 extended deny ip host 1.1.20.2 any (hitcnt=15) 0x7acba488
FW1(config)# %ASA-7-111009: User 'enable_15' executed cmd: show access-list
```

아래와 같이 맨 앞줄을 살펴보면 발생한 ACL 로그 개수와 알림 간격 (300초) 와 같은 정보가 타나난다.
{: .notice}

```
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 4096)
            alert-interval 300
```			

차단 로그 플로우의 수를 조정해보자
{: .notice--warning}

```
FW1(config)# access-list deny-flow-max 1000
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 1000)
            alert-interval 300
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 remark Testing no log option
access-list OUTSIDE-IN line 2 extended permit ip host 1.1.2.2 any (hitcnt=7) 0x82f498fb
access-list OUTSIDE-IN line 3 extended deny ip host 1.1.20.2 any (hitcnt=15) 0x7acba488
FW1(config)#

FW1(config)# access-list alert-interval 600
```

아래와 같이 설정이 바뀐 것을 볼 수 있다.
{: .notice--warning}

```
FW1(config)# show access-list
access-list cached ACL log flows: total 0, denied 0 (deny-flow-max 1000)
            alert-interval 600
access-list OUTSIDE-IN; 2 elements; name hash: 0x9ccc1a31
access-list OUTSIDE-IN line 1 remark Testing no log option
access-list OUTSIDE-IN line 2 extended permit ip host 1.1.2.2 any (hitcnt=7) 0x82f498fb
access-list OUTSIDE-IN line 3 extended deny ip host 1.1.20.2 any (hitcnt=15) 0x7acba488
```

