---
title: "Network: Spanning Tree"
last_modified_at: 2020-06-01T20:20:02-05:00
categories:
  - Network
tags:
  - STP
  - Spanning Tree
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 스패닝 트리 프로토콜 개념
---

* 이더넷 프레임 루핑: 이더넷 프레임이 장비들 사이에서 패킷이 돌고 돈다
* 스위치에서 이러한 이더넷 프레임 루핑을 방지해주는 것이 STP(Spanning Tree Protocol)
* IP 패킷의 경우 TTL 필드가 무한 루프를 방지해줌
{: .notice}

* 이더넷 프레임 루핑은 브로드캐스트 스톰을 발생시킨다
* 프레임이 Looping 되면서 MAC 주소 테이블을 수시로 변경시킨다 (Mac table 불안정)
* 이중 프레임 수신 (동일한 프레임 여러개 수신)
* STP가 looping을 해결하지 못할 때는 물리적 looping을 찾아 해결한다
{: .notice}

---
### 토폴로지 기본 설정
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/STP.JPG" alt="">
  <figcaption>스패닝 트리를 구성했다. SW3는 대체포트를 가져 Loop를 방지한다.</figcaption>
</figure> 


```
Router(config)# host R1
R1(config)# no ip domain-lookup
R1(config)# enable secret cisco

R1(config)# line console 0
R1(config-line)# logg sync
R1(config-line)# exec-t 0

R1(config-line)# line vty 0 4
R1(config-line)# password cisco
```

```
R1(config)# interface f0/0
R1(config-if)# ip address 1.1.1.1 255.255.255.0
R1(config-if)# no shut

R1(config)# interface f0/1
R1(config-if)# ip address 1.1.1.2 255.255.255.0
R1(config-if)# no shut
```

```
SW1(config)# interface f0/10
SW1(config-if)# shut

SW1(config)# interface f0/10
SW1(config-if)# shut
```

```
SW#2 show cdp neighbors
```

---
### STP 동작 
---

STP가 동작하면 물리적으로 루프 구조인 네트워크에서 특정 포트를 차단 상태로 바꾸어 논리적으로 루프가 발생하지 않도록한다
{: .notice}

* BPDU(Bridge Protocol Unit): STP는 BPDU 프레임을 이용하여 루프가 없는 경로를 구성한다
* 설정 BPDU: 스위치 및 포트 역할을 결정하기 위하여 사용
* TCN (Topology Change Notification) BPDU: 네트워크 구조 변경시 알리기 위해 사용
{: .notice}

* STP의 동작 순서
	* root 스위치 선택: bridge ID (priority + Mac address)
	* root 포트 선택: root 스위치 외 다른 모든 스위치는 root 포트를 선택한다
		* 경로값의 합이 최소
		* 인접 스위치 bridge ID 낮은 포트
		* 인접 스위치 port ID 낮은 포트
	* Designated 포트 선택: 한 세그먼트(스위치 간 연결) 당 하나씩 있어야한다
* VLAN당 하나의 STP가 동작하는 것을 PVST라고 부른다
{: .notice--info}

```
SW1>show spanning-tree vlan 1
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0002.1652.1154
             This bridge is the root
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0002.1652.1154
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/11           Desg FWD 19        128.11   P2p
Fa0/1            Desg FWD 19        128.1    P2p
Fa0/13           Desg FWD 19        128.13   P2p
```

* Root ID Priority 32769 // 루트 스위치의 우선순위를 표시한다. 기본값 32768 + VLAN번호 표시
* Address 0002.1652.1154 // 루트 스위치의 MAC 주소
* This bridge is the root // 현재 스위치가 root 스위치다
* Hello Time 2 sec Max Age 20 sec Forward Delay 15 sec // 설정된 각종 타이머
* Bridge ID Priority 32769 (priority 32768 sys-id-ext 1) // 현 스위치의 우선순위를 표시
* 현 스위치가 곧 root 스위치라서 표시 정보가 같다
* 타이머 정보의 경우 루트 스위치가 되었을때 사용되는 설정 값이다
* Role에는 Desg(지정포트), root(루트포트), Altn(대체 포트) 가 온다
* Status는 BLK(차단), LIS(청취), LRN(학습), FWD(전송) 및 Disabled(비활성)
* Cost는 경로값, Prio.Nbr 우선순위.포트번호
{: .notice--warning}

* 카탈리스트 스위치와 이더 스위치 모듈에서의 출력 형식이 좀 다르다
{: .notice--warning}

```
SW2>show spanning-tree vlan 1
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0002.1652.1154
             Cost        19
             Port        11(FastEthernet0/11)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.97A9.2080
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/12           Desg FWD 19        128.12   P2p
Fa0/11           Root FWD 19        128.11   P2p
```

```

SW3>show spanning-tree vlan 1
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0002.1652.1154
             Cost        19
             Port        13(FastEthernet0/13)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.FF5A.A330
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/12           Altn BLK 19        128.12   P2p
Fa0/13           Root FWD 19        128.13   P2p
```

---
### STP 포트
---

* MAC 주소가 가장 낮은 SW1이 Bridge ID도 가장 낮아서 루트 스위치가 된다
	* 루트 스위치는 루트 포트를 가지지 않는다
* SW2,3에서는 루트 포트를 선택하는데 포트의 경로값이 작은 것이 선택된다
* 지정포트는 세그먼트당 반드시 하나 있어야한다 (두 노드 중 적어도 하나는 지정포트를 가져야한다)
* 라우터는 지정포트도 루트포트도 가지지 않는다 (따라서, 라우터와 연결된 반대쪽 포트는 지정 포트가 된다)
* 양쪽 포트가 둘다 지정 포트를 가질 경우 경쟁을 한다
	* 경로값, 브리지 ID 비교하여 낮은 포트가 지정 포트가 되고 다른 하나는 대체 포트가된다
* 대체 포트는 데이터 프레임의 송수신이 차단된다(Loop 제거), 하지만 상대측 지정 포트가 전송하는 BPDU는 수신한다
{: .notice--info}

---
### STP 포트 상태
---

STP의 포트는 차단(Block), 청취(Listening), 학습(Learning), 전송(Forwarding) 및 비활성(Disabled) 상태로 분류한다  
스위치의 전원을 켜면 하드웨어 구성 및 동작을 확인하는 POST 과정을 거친다 그 후 포트의 역할이 지정되고 여러 상태를 거친다  
{: .notice}

* 차단 상태: 데이터 프레임 송수신 x, BPDU 수신
	* 루트 포트, 지정 포트가 되면 청취 상태로, 대체 포트가 되면 차단 상태가 된다
	* 대체 포트에서 루트 혹은 지정 포트가 될 경우 20초 후에 청취 상태로 변한다(max age)
* 청취 상태: BPDU 전송
	* 지정 포트는 청취 상태에 BDPU를 전송한다 이후 15초 경과시 학습상태가 된다(forward delay)
* 학습 상태: MAC 주소 테이블을 채운다, 15초 경과시 전송 상태로 변경된다
* 전송 상태: 정상적으로 데이터 프레임을 송수신 한다
* 비활성화 상태: Down 상태에 있는 포트
{: .notice--info}

---
### 네트워크 장애 시 STP의 동작
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/STP2.JPG" alt="">
  <figcaption>SW1과 SW2 사이에 장애가 발생했다</figcaption>
</figure> 

* SW1과 SW2를 연결하는 Fa 0/11 포트들은 비활성화되면서 차단 상태로 변한다
* SW3는 BPDU를 SW2로 부터 수신하여 링크에 장애가 발생함을 알고 DP로 변경된다
	* 20초의 max age 타이머가 만료된 후에 전송 상태로 변경
	* 이후 청취 상태 15초, 학습 상태 15초 기다린 후 전송상태에서 데이터 프레임을 송수신
* 이러한 적응 시간을 줄이기 위해 RSTP가 IEEE 표준이 되었다
* 만약 SW3와 직접 연결된 링크가 다운되었다면 SW3는 max age를 동작x 바로 청취 상태로 들어감
{: .notice}


* 포트 패스트: 포트 활성화시 바로 전송 상태가 되게 하는 것을 말 한다
{: .notice}

```
SW1(config)# interface f0/1
SW1(config-if)# spanning-tree portfast
SW1(config-if)# shut
SW1(config-if)# no shut
```

---
### 부하분산
---

* root 스위치 선별에 있어서 , 브리지 우선순위가 모두 동일 하므로 Mac 주소가 낮은 오래된 스위치가 루트 스위치로 동작할 가능성이 높다
* 이때 기본 적으로 모든 VLAN에 대해서 동일한 스위치가 루트 스위치의 역할을 하므로 특정한 링크는 사용하지 않아 효율이 떨어진다
* VLAN 당 서로 다른 스위치를 루트 스위치로 동작시켜 부하분산을 유도하는 것이 좋다
{: .notice}

VLAN을 설정을 위해 트렁크 설정부터 해보자
{: .notice}

```
SW1(config)# interface range f0/11,f0/13
SW1(config-if)# switchport trunk encapsulation dot1q
SW1(config)# switchprot mode trunk

SW2(config)# interface range f0/11-12
SW2(config-if)# switchport trunk encapsulation dot1q
SW2(config-if)# switchprot mode trunk

SW3(config)# interface range f0/12-13
SW3(config-if)# switchport trunk encapsulation dot1q
SW3(config-if)# switchprot mode trunk
```

VTP 설정을 해보자 
{: .notice}

```
SW1(config)# vtp domain VTP_01

SW2# show vtp status | include VTP_01
VTP Domain Name		:VTP_01
```

VLAN 설정을 해보자 
{: .notice}

```
SW1(config)# vlan 10
SW1(config-vlan)# name 1st_VLAN
SW1(config-vlan)# vlan 20
SW1(config-vlan)# name 2nd_VLAN
SW1(config-vlan)# exit
```

루트 스위치 설정을 해보자. SW1을 VLAN10의 루트로 SW2를 VLAN 10의 제2 루트로 설정 
{: .notice}

```
SW1(config)# spanning-tree vlan 10 root primary
SW2(config)# spanning-tree vlan 10 root secondary
```

직접 우선순위를 설정하는 방법도 있다. SW2를 VLAN20의 루트로 SW1을 VLAN 20의 제 2루트로 설정 
{: .notice}

```
SW2(config)# spanning-tree vlan 10 root priority 0
SW1(config)# spanning-tree vlan 20 root priority 4096
```

확인 하는법
{: .notice}

```
SW1# show spanning-tree vlan 10 root
SW2# show spanning-tree vlan 20 root
```

결과로 vlan 10에 대해서는 f0/12포트가 대체 포트로 차단상태가 되고  
vlan 20에서는 f0/13이 대체 포트로 차단 상태가 된다  
즉, vlan 마다 조금씩 다른 포트를 사용하면서 모든 포트가 사용된다
{: .notice}

---
### 이더채널, RSTP, MSTP
---







