---
title: "Network: HSRP"
last_modified_at: 2020-08-17T20:20:02-05:00
categories:
  - Network
tags:
  - HSRP
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 토폴로지 구성
---

HSRP 실습을 위한 토폴로지 구성을 먼저 해보자
{: .notice}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/hsrp1.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```
conf t 
int fa 0/0
ip add 10.1.1.2 255.255.255.0
no shut
int fa 0/1
ip add 1.1.1.2 255.255.255.0
no shut

conf t 
int fa 0/0
ip add 10.1.1.3 255.255.255.0
no shut
int fa 0/1
ip add 1.1.1.3 255.255.255.0
no shut

conf t 
int fa 0/1
ip add 1.1.1.4 255.255.255.0
no shut
int lo0
ip add 4.4.4.4 255.255.255.0

conf t 
int fa 0
ip add 10.1.1.11 255.255.255.0
no shut

conf t 
int fa 0
ip add 10.1.1.12 255.255.255.0
no shut

conf t 
int fa 0
ip add 10.1.1.13 255.255.255.0
no shut
```

---
### HSRP 개념
---


NAT 이중화란 하나의 NAT 장비가 동작하지 않을 때 다른 NAT 장비를 동작시키는 것을 말한다.
{: .notice}

* NAT 이중화는 다음과 같이 구분할 수 있다
* HSRP를 이용한 NAT 이중화
* NAT Box-To-Box 이중화
{: .notice--warning}

HSRP(hot standby router protocol)는 시스코에서 개발한 게이트웨이 이중화 프로토콜이다. HSRP는 게이트웨이 역할을 하논 라우터 또는 L3 스위치 사이에서 동작한다.
{: .notice}

HSRP는 스탠바이 그룹(standby group) 별로 하나의 액티브(active) 라우터와 하나의 스탠바이(standby) 라우터를 뽑는다. 액티브 라우터는 게이트웨이 역할을 수 행하며, 스탠바이 라우터는 액티브 라우터에 장애가 발생하면 해당 역할을 이어받는다.
{: .notice}

---
### HSRP 실습
---

R2가 Active 라우터 R3가 Standby 라우터가 될 것이다.  
R3를 통해 주소 변환이 되도록 할 것이다.  
{: .notice}

HSRP는 스탠바이 그룹(standby group) 별로 하나의 액티브(active) 라우터와 하 나의 스탠바이(standby) 라우터를 뽑는다. 액티브 라우터는 게이트웨이 역할을 수 행하며, 스탠바이 라우터는 액티브 라우터에 장애가 발생하면 해당 역할을 이어받는다.
{: .notice}

```
R2# int fa 0/0
R2(if)# standby 1 ip 10.1.1.254
```

Virtural ip를 부여해야 비로소 HSRP가 동작한다.
{: .notice}

```
R3# int fa 0/0
R3(if)# standby 1 ip 10.1.1.254
```

똑 같은 설정시 리얼 아이피가 높은애가 active가 되어서 R3가 되어버린다.
그래서 priority를 줘야한다.
{: .notice}

```
R2# int fa 0/0
R2(if)# standby 1 ip 10.1.1.254
R2(if)# standby 1 priority 105	//(active로 사용할 라우터에만 쓴다)
R2(if)# standby 1 track object //(특정한 객체를 추적하도록한다. 예로 네트워크 상태, 라우팅 테이블 등등)
R2(if)# standby 1 preempt	//(standby에서 active였다가 다시 정상적으로 돌아오면 권한을 다시 빼앗는다)

R2(if)# standby 1 preempt
R3# int fa 0/0
R3(if)# standby 1 ip 10.1.1.254
```

의미를 좀더 자세히 분석하자면 다음과 같다
{: .notice}

```
track 1 int fa0/1 ip routing
Int 에 있는 routing 기능을 추적하도록 object를 만들어준다. (ip routing이 유효한지 검사한다)
(트래킹할 인터페이스를 f0/1로 설정)
int fa 0/0	(inf fa 0/0 )HSRP 인터페이스 설정 모드로 들어간다
standby 1 ip 10.1.1.254	HSRP 그룹번호와 가상 IP 주소를 지정한다.
standby 1 priority 105	우선순위를 낮춰준다 (디폴트 110)
standby 1 track fa0/0	
(standby 1 track 1 decrement 10 다운되면 우선순위를 낮춘다 )
standby 1 preempt	기능이 정상적으로 돌아오면 다시 active가 되도록 설정
```

이어서 R2와 R3를 설정해주자
{: .notice}

```
#R2
conf t
track 1 int fa0/1 ip routing
exit
int fa 0/0
standby 1 name HSRP-NAT
standby 1 ip 10.1.1.254
standby 1 priority 105
```

Tracking 기능을 활성화 하자
{: .notice}

```
Standby 1 track fa 0/1  -> 2계층만 추적 가능하다 ( fa 0/0 is up ~  추적한다 , ip나 routing 활성화에 대한 것은 추적을 못한다)
standby 1 track 1 decrement 10
standby 1 preempt
```

이제 설정이 잘 되었나 확인해보자
{: .notice}

```
R2(config-if)#do show run | section FastEthernet0/0
interface FastEthernet0/0
 ip address 10.1.1.2 255.255.255.0
 duplex auto
 speed auto
 standby 1 ip 10.1.1.254
 standby 1 priority 105
 standby 1 preempt
 standby 1 name HSRP-NAT
 standby 1 track 1 decrement 10
R2(config-if)#
```

HSRP가 서로 반대 interface를 추적 해야한다. 예로 R4에서 내부로 들어가는 패킷은 SW1 쪽의 패킷이 잘 흐르는지 확인이 되어야 보내지는거니까 R2의 Fa0/1 은 Fa0/0 을 트랙킹 한다.
{: .notice}
R2 fa0/1에  문제가 생기면 R4는 패킷을 R3로 보내고  PC들도 SW1 을 경유하여 R2로 갔다가 Fa0/1에서 나가지 못하고 R3로 다시 가게된다 그러면 리다이렉션 현상이 생겨버려서 양방향으로 HSRP를 설정해줄것이다.
{: .notice}

```
#R3
conf t
int fa 0/0
standby 1 name HSRP-NAT
standby 1 ip 10.1.1.254
standby 1 preempt
```

그러면 다음과 같은 메시지가 뜬다.
{: .notice}

```
R3(config-if)#
*Mar  1 00:47:24.207: %HSRP-5-STATECHANGE: FastEthernet0/0 Grp 1 state Speak -> Standby


R2(config-if)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    105 P Active  local           10.1.1.3        10.1.1.254
R2(config-if)#

R3(config-if)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    100 P Standby 10.1.1.2        local           10.1.1.254
R3(config-if)#
```

```
#PC1 ,2 ,3 에 들어가서 다음과 같이 게이트 웨이 설정해준다
conf t
no ip routing
ip default-gateway 10.1.1.254  (아까 설정했던 virtual HSRP 주소로 )
end
```

지금 까지 설정한 부분은 아래에 파란색으로 표시한 부분이다.
{: .notice}
<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/hsrp2.jpg" alt="">
  <figcaption> </figcaption>
</figure>

이제 반대쪽(빨간색)도 HSRP 설정을 해줄 것이다.
{: .notice}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/hsrp3.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```
#R2
conf t
track 1 int fa0/1 ip routing
exit
int fa 0/0
standby 1 name HSRP-NAT
standby 1 ip 10.1.1.254
standby 1 priority 105
standby 1 track 1 decrement 10
standby 1 preempt
```

설정이 잘 되었는지 확인을 해보자.
{: .notice}

```
R2(config-if)#do show run | section FastEthernet
track 1 interface FastEthernet0/1 ip routing
track 2 interface FastEthernet0/0 ip routing
interface FastEthernet0/0
 ip address 10.1.1.2 255.255.255.0
 duplex auto
 speed auto
 standby 1 ip 10.1.1.254
 standby 1 priority 105
 standby 1 preempt
 standby 1 name HSRP-NAT
 standby 1 track 1 decrement 10
interface FastEthernet0/1
 ip address 1.1.1.2 255.255.255.0
 duplex auto
 speed auto
 standby 2 ip 1.1.1.254
 standby 2 priority 105
 standby 2 preempt
 standby 2 name HSRP-NAT2
 standby 2 track 2 decrement 10
R2(config-if)#
```
R3도 마저 설정하고 최종 확인을 해보자
{: .notice}

```
#R3
conf t
int fa 0/1
standby 2 name HSRP-NAT2
standby 2 ip 1.1.1.254
standby 2 preempt
```
```
R2(config-if)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    105 P Active  local           10.1.1.3        10.1.1.254
Fa0/1       2    105 P Active  local           1.1.1.3         1.1.1.254
R2(config-if)#

R3(config-if)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    100 P Standby 10.1.1.2        local           10.1.1.254
Fa0/1       2    100 P Standby 1.1.1.2         local           1.1.1.254
```

이제 PC 1  3 에서 traceroute를 해보자.  
R4에서 사설 ip 등록을 일단 해줘야 한다.  
{: .notice}

```
#R4
conf t
ip route 10.1.1.0 255.255.255.0 1.1.1.254
```

실험하고 바로 지울 것이다.
{: .notice}

```
PC1#traceroute 1.1.1.4

Type escape sequence to abort.
Tracing the route to 1.1.1.4

  1 10.1.1.2 12 msec 8 msec 32 msec
  2 1.1.1.4 60 msec 44 msec
PC1#
```
```
PC3#traceroute 1.1.1.4

Type escape sequence to abort.
Tracing the route to 1.1.1.4

  1 10.1.1.2 0 msec 36 msec 24 msec
  2 1.1.1.4 60 msec 64 msec 40 msec
PC3#
```

R3는 동일 네트워크니까 Gateway를 지나지 않고 바로 간다.
{: .notice}

```
R3#traceroute 1.1.1.4
Type escape sequence to abort.
Tracing the route to 1.1.1.4

  1  *
    1.1.1.4 20 msec 28 msec
```

이제 한쪽을 다운시켜보고자 한다.
{: .notice}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/hsrp4.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```
R2(config)#int fa 0/0
R2(config-if)#shut


R2(config-if)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    105 P Init    unknown         unknown         10.1.1.254
Fa0/1       2    95  P Standby 1.1.1.3         local           1.1.1.254
R2(config-if)#


R3(config)#do show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Fa0/0       1    100 P Active  local           unknown         10.1.1.254
Fa0/1       2    100 P Active  local           1.1.1.2         1.1.1.254
```

R3가 Active를 빼앗아 갔다. PC들도 1.1.1.2를 거치던 것이 10.1.1.3을 거치게 되었다.
{: .notice}

```
PC1#traceroute 1.1.1.4

Type escape sequence to abort.
Tracing the route to 1.1.1.4

  1  *
    10.1.1.3 16 msec 36 msec
  2 1.1.1.4 100 msec 48 msec 44 msec
PC1#


PC3#traceroute 1.1.1.4

Type escape sequence to abort.
Tracing the route to 1.1.1.4

  1  *
    10.1.1.3 8 msec 32 msec
  2 1.1.1.4 48 msec 64 msec 60 msec
PC3#
```

ISP 라우터인 R4에서는 R2, R3에서 사용할 공인 IP주소 2.2.2.0/24 네트워크에 대한 경로를 정적으로 설정하고 최종 저장합니다.
{: .notice}

```
#R2, R3
ip route 0.0.0.0 0.0.0.0 1.1.1.4
end
```
```
#R4
ip route 2.2.2.0 255.255.255.0 1.1.1.254
end

conf t
line vty 0 4
password cisco
login
end
```



