---
title: "Network: PAT"
last_modified_at: 2020-08-14T20:20:02-05:00
categories:
  - Network
tags:
  - PAT
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 토폴로지 설정
---

8월 13일자 NAT 토폴로지 설정을 참고하자.
{: .notice}

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/nat1.JPG" alt="">
  <figcaption> </figcaption>
</figure>

```
conf t 
int fa 0/1
ip add 10.1.1.1 255.255.255.0
no shut
int fa 0/0
ip add 10.1.100.1 255.255.255.0
no shut

conf t 
int fa 0/1
ip add 10.1.2.2 255.255.255.0
no shut
int fa 0/0
ip add 10.1.100.2 255.255.255.0
no shut

conf t 
int fa 0/0
ip add 10.1.100.3 255.255.255.0
no shut
int fa 0/1
ip add 1.1.34.3 255.255.255.0
no shut
int lo0
ip add 10.1.3.3 255.255.255.0
no shut

conf t
int fa 0/0
ip add 1.1.34.4 255.255.255.0
no shut
int fa 0/1
ip add 1.1.4.4 255.255.255.0
no shut
```

라우팅 테이블은 돌리면 안된다. 외부 망 까지 광고 해서 다 라우팅 테이블에 기록되어서 
굳이 하자면 ospf를 사용할 네트워크만 지정해서 만들어준다. 
외부망인 1.1.34.0 대역대는 하지 않는다. 
{: .notice}

```
#R3
conf t
ip route 0.0.0.0 0.0.0.0 1.1.34.4

router ospf 1
router-id 3.3.3.3
network 10.1.3.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
default-information originate
end

#R1
conf t
router ospf 1
router-id 1.1.1.1
network 10.1.1.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
end

#R2
conf t
router ospf 1
router-id 2.2.2.2
network 10.1.2.0 0.0.0.255 area 0
network 10.1.100.0 0.0.0.255 area 0
end
```

default-information originate 는 ospf 에서 자신을 디폴트 게이트웨이로 설정함
{: .notice}

설정이 잘되었는지 ping을 통해 확인해보자.
{: .notice}

```
R3#ping 10.1.1.1 source 10.1.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
Packet sent with a source address of 10.1.3.3
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/28/36 ms

R1#ping 1.1.34.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.34.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/28/32 ms
R1#

R2#ping 1.1.34.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.34.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 32/37/44 ms
```

추가 적으로 telnet과 http 서비스를 사용할 수 있도록 설정 해준다.
{: .notice}
```
#R1
conf t
line vty 0 4
password cisco
login
end
```
```
#R2
conf t
ip http server
```
```
R3#telnet 10.1.100.1
Trying 10.1.100.1 ... Open
User Access Verification
Password:
R1>exit

[Connection to 10.1.100.1 closed by foreign host]
```
```
R3#telnet 10.1.100.2 80
Trying 10.1.100.2, 80 ... Open
exit()
HTTP/1.1 400 Bad Request
Date: Fri, 01 Mar 2002 00:10:06 GMT
Server: cisco-IOS
Accept-Ranges: none

400 Bad Request
[Connection to 10.1.100.2 closed by foreign host]
```
```
R2(config)#line vty 0 4
R2(config-line)#no password
R2(config-line)#login
% Login disabled on line 162, until 'password' is set
% Login disabled on line 163, until 'password' is set
% Login disabled on line 164, until 'password' is set
% Login disabled on line 165, until 'password' is set
% Login disabled on line 166, until 'password' is set
R2(config-line)#end
R2#
```

```
R3#telnet 10.1.100.2
Trying 10.1.100.2 ... Open
Password required, but none set
[Connection to 10.1.100.2 closed by foreign host]
R3#
```

---
### 정적 PAT 실습
---
```
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#ip nat inside source ?
  list       Specify access list describing local addresses
  route-map  Specify route-map
  static     Specify static local->global mapping
```

지금은 static을 사용할 것이다. Ip 주소만 적으면 직접 ip 주소를 통해서 NAT을 설정하게된다.
우리는 PAT를 할 것이다.
{: .notice--info}
```
R3(config)#ip nat inside source static tcp 10.1.1.1 ?
<1-65535>  Local UDP/TCP port
(inside local 사용자가 실제 사용하는 장비주소 입력 10.1.1.1)
```
```
R3(config)#ip nat inside source static tcp 10.1.1.1 23 2.2.2.201 23
(들어올 때 23 나갈때 23 으로 설정한다는 뜻이다)
R3(config)#ip nat inside source static tcp 10.1.2.2 80 2.2.2.201 80
```
```
R3(config)#int fa 0/0
R3(config-if)#ip nat inside
R3(config-if)#int fa 0/1
R3(config-if)#ip nat outside
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.201:23       10.1.1.1:23        ---                ---
tcp 2.2.2.201:80       10.1.2.2:80        ---                ---
R3(config-if)#
```

설정된 것을 Test 해보자
{: .notice}

우선 R4에서 R1으로 telnet 한 후 translation 정보를 조회해보자
{: .notice}

```
R4#telnet 2.2.2.201
Trying 2.2.2.201 ... Open
User Access Verification
Password:
R1>
```
```
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.201:23       10.1.1.1:23        1.1.34.4:36832     1.1.34.4:36832
tcp 2.2.2.201:23       10.1.1.1:23        ---                ---
tcp 2.2.2.201:80       10.1.2.2:80        ---                ---
R3(config-if)#
```

R4에서 R1으로 http 접속 후에 translation 정보를 조회해보자
{: .notice}

```
R4#telnet 2.2.2.201 80
Trying 2.2.2.201, 80 ... Open
quit
HTTP/1.1 400 Bad Request
Date: Fri, 01 Mar 2002 00:20:19 GMT
Server: cisco-IOS
Accept-Ranges: none

400 Bad Request

[Connection to 2.2.2.201 closed by foreign host]
```
```
R3(config-if)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.201:23       10.1.1.1:23        1.1.34.4:36832     1.1.34.4:36832
tcp 2.2.2.201:23       10.1.1.1:23        ---                ---
tcp 2.2.2.201:80       10.1.2.2:80        1.1.34.4:40417     1.1.34.4:40417
tcp 2.2.2.201:80       10.1.2.2:80        ---                ---
```


포트별로 서버를 다르게 연결해주고 싶을 때 사용한다.  
포트 포워딩이 PAT의 기능 중 하나라고 보면 되겠다.  
{: .notice--info}

선생님은 8개 정도의 포트포워딩을 사용하고있는데 그 중에 출발 도착지 21 번 포트를 열어놓은 것과
53???? ~ 53????? 번 대를 열어놓은 것을 보면 무슨 생각이 드는가? 바로바로 ! FTP Passive 모드 이다.
{: .notice--info}

공인 ip 주소가 같아도 포트 번호만 다르게 해서 다른 라우터로도 연결 할 수 있다는 것을 보여주겠다. 테스트 해보자
{: .notice}

```
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#line vty 0 4
R2(config-line)#password cisco
R2(config-line)#login
R2(config-line)#end
```
```
R3(config-if)#ip nat inside source static tcp 10.1.2.2 23 2.2.2.201 2323
```
```
R4#telnet 2.2.2.201 2323
Trying 2.2.2.201, 2323 ... Open
User Access Verification
Password:
R2>
```
```
R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 2.2.2.201:23       10.1.1.1:23        ---                ---
tcp 2.2.2.201:2323     10.1.2.2:23        1.1.34.4:24696     1.1.34.4:24696
tcp 2.2.2.201:2323     10.1.2.2:23        ---                ---
tcp 2.2.2.201:80       10.1.2.2:80        ---                ---
R3(config)#
```
2.2.2.201:2323 을 통해서 R2의 telnet 서비스에 접속한 것을 볼 수있다.
{: .notice}


---
### 동적 PAT 실습
---

동적 PAT 설정을 위해 다시 초기화 하자
{: .notice}
```
R3(config)#do show run | include nat
 ip nat inside
 ip nat outside
 default-information originate
ip nat inside source static tcp 10.1.1.1 23 2.2.2.201 23 extendable
ip nat inside source static tcp 10.1.2.2 80 2.2.2.201 80 extendable
ip nat inside source static tcp 10.1.2.2 23 2.2.2.201 2323 extendable
R3(config)#no ip nat inside source static tcp 10.1.1.1 23 2.2.2.201 23
R3(config)#no ip nat inside source static tcp 10.1.2.2 80 2.2.2.201 80
R3(config)#no ip nat inside source static tcp 10.1.2.2 23 2.2.2.201 2323

Static entry in use, do you want to delete child entries? [no]: yes
```
```
R3(config)#
R3(config)#
R3(config)#do show run | include nat
 ip nat inside
 ip nat outside
 default-information originate
```

```
R3(config)#do clear ip nat translation *
R3(config)#no ip nat inside source list Private pool Public overload


R3(config)#ip nat inside source list Private int fa 0/1 overload
R3(config)#do show ip nat translation
```


R1 과 R2 에서 telnet 1.1.4.4
{: .notice}

```
R3(config)#do show ip nat translation
Pro Inside global      Inside local       Outside local      Outside global
tcp 1.1.34.3:48778     10.1.100.1:48778   1.1.4.4:23         1.1.4.4:23
tcp 1.1.34.3:33659     10.1.100.2:33659   1.1.4.4:23         1.1.4.4:23
R3(config)#
```

* 목적지애 따른주소 변환
* 패킷의 목적지 주소 별로 서로 다른 공인 IP주소를 사용하여 변환시키려면 다음 두 가지 방법을 사용할 수 있다.
	* 확장 ACL 사용한 PAT
	* 루트맵을 사용한 NAT 또는 PAT
* 예를 들어, 목적지가 1.1.4.0/24이면 공인 IP 주소 2.2.2.250을 사용하고, 1.1.34.0/24이면 2.2.2.251 을 사용하도록 설정해 보자.
* CCNP에나 나오는데 ACL은 필터링 할 수 있는데  루트 맵은 분류만 한다(패킷 분류가 목적)
{: .notice}

일단 우리는 extended ACL 로 설정 해볼것이다.
{: .notice}
```
R3(config)#no ip nat inside source list Private int fa 0/1 overload

Dynamic mapping in use, do you want to delete all entries? [no]: yes            R3(config)#do clear ip nat translation *
R3(config)#do show ip nat translation
```
```
R3(config)#ip access-list extended REMOTE-PUBLIC1
R3(config-ext-nacl)#permit ip 10.0.0.0 0.255.255.255 1.1.4.0 0.0.0.255
R3(config-ext-nacl)#exit
R3(config)#ip access-list extended REMOTE-PUBLIC2
R3(config-ext-nacl)#permit ip 10.0.0.0 0.255.255.255 1.1.34.0 0.0.0.255
R3(config-ext-nacl)#exit
R3(config)#ip nat pool LOCAL-PUBLIC 2.2.2.250 2.2.2.250 netmask 255.255.255.0
R3(config)#exit
```
```
R3(config)#ip nat pool LOCAL-PUBLIC1 2.2.2.250 2.2.2.250 prefix 24
R3(config)#ip nat pool LOCAL-PUBLIC2 2.2.2.251 2.2.2.251 prefix 24
R3(config)#ip nat inside source route-map REMOTE1 pool LOCAL-PUBLIC1 overload
R3(config)#ip nat inside source route-map REMOTE2 pool LOCAL-PUBLIC2 overload
```

R1과 R2에서 각각 telnet 1.1.3.4. 하고 나서 R3 를 보면
{: .notice}
```
2.2.2.251 10.1.100.1  1.1.34.4:23 1.1.34.4:23  
2.2.2.251 10.1.100.2  1.1.34.4:23 1.1.34.4:23 
꼴로 추가됨 ..
```

R4에서 conf t, Ip http server 하고 나서 R1 R2 에서 1.1.4.4 80 하고 나서 R3를 보면
{: .notice}
```
2.2.2.250 10.1.100.1 1.1.4.4:80 1.1.4.4:80
2.2.2.250 10.1.100.1 1.1.4.4:80 1.1.4.4:80
```
telnet 1.1.4.4 하고나서 보면 
{: .notice}
```
2.2.2.250 10.1.100.2 1.1.4.4:80 1.1.4.4:80 
```
Telent 1.1.34.4 로 하면  
2.2.2.251  ~~ 로 기록이 남는데  
1.1.4.4 로 하면  
2.2.2.250 ~~~ 으로 기록이 남는다  
{: .notice}










