---
title: "Security: 방화벽 NAT"
last_modified_at: 2020-08-25T20:20:02-05:00
categories:
  - Security
tags:
  - Firewall
  - ASA
  - NAT
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 토폴로지 설정
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_nat1.jpg" alt="">
  <figcaption> </figcaption>
</figure>

위와 같이 R1 ~ R4 인터페이스에 주소를 할당해준다.
{: .notice}

```
R1#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.10.1       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.1.1        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```
R2#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.23.2       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.2.2        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```
R3#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.23.3       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.3.3        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```
R4#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            1.1.40.4        YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            1.1.4.4         YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```

방화벽의 인터페이스에 nameif로 inside, dmz, outside을 설정해준다. 
{: .notice}

```
ciscoasa> enable
Password:
ciscoasa# conf t
ciscoasa(config)# hostname FW1
FW1(config)# end
FW1# copy r s
FW1# reload

FW1# conf t
FW1(config)# int gi 0/0
FW1(config-if)# nameif inside
INFO: Security level for "inside" set to 100 by default.
FW1(config-if)# ip add 10.1.10.10 255.255.255.0
FW1(config-if)# no shut

FW1(config-if)# ping 10.1.10.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 10/24/70 ms

FW1(config-if)# int gi 0/1
FW1(config-if)# nameif dmz
INFO: Security level for "dmz" set to 0 by default.
FW1(config-if)# security-level 50
FW1(config-if)# ip add 10.1.23.10 255.255.255.0
FW1(config-if)# no shut
FW1(config-if)# end

FW1# conf t
FW1(config)# int gi 0/2
FW1(config-if)# nameif outside
INFO: Security level for "outside" set to 0 by default.
FW1(config-if)# ip add 1.1.40.10 255.255.255.0
FW1(config-if)# no shut
```

설정이 다 되었으면 Ping으로 연결이 잘되었는지 확인한다.
{: .notice}

```
FW1# ping 10.1.23.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.23.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/20 ms

FW1# ping 10.1.23.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.23.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/26/50 ms

FW1# ping 1.1.40.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.40.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 10/22/40 ms
```

이어서 ospf 설정을 해주고 모르는 패킷이 도착할 경우 1.1.40.4 로 포워드 하도록 설정해준다.
{: .notice}

```
FW1# conf t
FW1(config)# route outside 0.0.0.0 0.0.0.0 1.1.40.4
FW1(config)# router ospf 1
FW1(config-router)# network 10.1.10.0 255.255.255.0 area 0
FW1(config-router)# network 10.1.23.0 255.255.255.0 area 0
FW1(config-router)# default-information originate
FW1(config-router)# end
FW1# copy r s
```

R1 ~ R4도 설정을 해주자.
{: .notice}

```
#R1
conf t
router ospf 1
network 10.1.10.0 0.0.0.255 area 0
network 10.1.1.0 0.0.0.255 area 0

#R2
conf t
router ospf 1
network 10.1.23.0 0.0.0.255 area 0
network 10.1.2.0 0.0.0.255 area 0

#R3
conf t
router ospf 1
network 10.1.23.0 0.0.0.255 area 0
network 10.1.3.0 0.0.0.255 area 0
```

nat 설정을 할 구간은 FW1의 gi 0/2와 R4의 f0/0 이다. 공인 IP로 2.2.2.0을 사용할 것이므로 
2.2.2.0 주소 대역대로 부터 패킷이 오면 1.1.40.10 으로 넘겨준다.
{: .notice}

```
R4#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#ip route 2.2.2.0 255.255.255.0 1.1.40.10
```

```
FW1# show route

Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, V - VPN
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, + - replicated route
Gateway of last resort is 1.1.40.4 to network 0.0.0.0

S*       0.0.0.0 0.0.0.0 [1/0] via 1.1.40.4, outside
C        1.1.40.0 255.255.255.0 is directly connected, outside
L        1.1.40.10 255.255.255.255 is directly connected, outside
O        10.1.1.0 255.255.255.0 [110/20] via 10.1.10.1, 00:04:12, inside
O        10.1.2.0 255.255.255.0 [110/20] via 10.1.23.2, 00:05:15, dmz
O        10.1.3.0 255.255.255.0 [110/20] via 10.1.23.3, 00:03:19, dmz
C        10.1.10.0 255.255.255.0 is directly connected, inside
L        10.1.10.10 255.255.255.255 is directly connected, inside
C        10.1.23.0 255.255.255.0 is directly connected, dmz
L        10.1.23.10 255.255.255.255 is directly connected, dmz
```

---
### 방화벽 NAT
---


NAT(Network address translation)는 관리자가 지정한 IP주소나 네트워크 대역 또는 포트번호를 변화하여
외부로 전송한다. IPv4의 주소 고갈 문제해결, 변환된 주소로 통신하여 보안을 강화하는 목적이 있다.
{: .notice}

* **NAT 종류**
* 정적 NAT/PAT: 주소 변환에 필요한 정보를 NAT 테이블에 반영구적으로 저장. 어느 방향에서도 통신을 시작할 수 있다.
정적 PAT는 TCP/UDP 포트 번호까지 변환할 수 있다. 예로 서로 다른 주소를 가진 서비스들을 같은 주소의 다른 포트번호를 가지도록 설정할 수 있다.
* 동적 NAT/PAT: 동적 NAT는 정책에 부합하는 트래픽이 발생하는 순간 변환 주소가 할당된다. NAT 테이블에 임시로 저장이 되고 통신이 끝나면 제거된다.
 따라서 반대방향에서는 통신을 시작할 수 없다. (평소 테이블에 아무 정보가 없기 때문이다.) 제거 시간은 timeout xlate 명령어로 변경할 수 있다.
  동적 PAT는 사실 IP와 포트 번호를 공인 IP 주소와 1024 이후의 포트 번호로 변환한다. 
* 폴리시 NAT/PAT: 폴리시 NAT는 출발지와 목적지에 따라 변환이 일어난다. 출발지, 목적지에 따라서 다르게 변환한다. 정책 기반 NAT라고도 볼 수 있다.
* 바이패스 NAT: VPN 동작시 NAT를 통해 주소변환이 동작하면 안된다. 이러한 상황에서 쓰이는 NAT이며 특정 출발지와 목적지를 가진 패킷만 
주소변환을 하지 않고 라우팅 된다.
{: .notice--info}


```
예시)정적 NAT
사설 IP			공인IP 
10.1.1.1		2.2.2.101:ANY
10.1.2.2		2.2.2.102:ANY
예시)정적 PAT
사설 IP			공인IP
10.1.1.1:80		2.2.2.100:80
10.1.2.2.:21	2.2.2.100:21
```

* **NAT 구현 방식**
* 오브젝트 NAT(오토 NAT): 오브젝트 안에서 주소 변환 대상과 변환할 IP 또는 IP 대역을 설정한다. 
간단하고 가장 많이 사용한다. 설정 순서 상관없이 세부적인 정책일수록 NAT 테이블 상위에 등록된다.
* 트와이스 NAT(매뉴얼 NAT): 출발지와 목적지 주소를 모두 참고하여 주소 변환이 가능한 방식이다.
예로 들어, 특정 출발지 주소를 가진 패킷이 특정 목적지를 향할 때 주소를 변환한다. 오토 NAT와는 다르게 
설정 순서대로 NAT 테이블에 등록되고 관리자가 직접 순서를 제어한다.
{: .notice--info}

* **NAT 동작 순서**
* 매뉴얼 NAT
* 오토 NAT
* 메뉴얼 NAT(after-auto 옵션을 사용한 경우)
{: .notice--warning}














