---
title: "Network: RIPv2 "
last_modified_at: 2020-07-09 T20:20:02-05:00
categories:
  - Network
tags:
  - Routing protocol
  - RIPv2
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### RIPv2 프로토콜
---

* RIP: 동적인 라우팅 프로토콜 중 가장 오래됨, 동작 방식 간단, 설정 간단
* RIPv1은 거의 사용하지 않는다 (Classful)
* RIPv2는 벨만포드 알고리즘을 사용합니다
{: .notice}

기본 설정
{: .notice}
```
R1#enable
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f0/0
R1(config-if)#ip address 1.1.10.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#
R1(config)#int f0/1
R1(config-if)#ip address 1.1.12.1 255.255.255.0
R1(config-if)#no shut
```

```
R2#enable
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#int f0/1
R2(config-if)#ip address 1.1.12.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#exit
R2(config)#
R2(config)#int f0/0
R2(config-if)#ip address 1.1.23.2 255.255.255.0
R2(config-if)#no shut
```

```
R3#enable
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int f0/0
R3(config-if)#ip address 1.1.23.3 255.255.255.0
R3(config-if)#no shut
R3(config-if)#exit
R3(config)#
R3(config)#int f0/1
R3(config-if)#ip address 1.1.30.3 255.255.255.0
R3(config-if)#no shut
```

기본적인 RIP 설정
{: .notice}

```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router rip  //RIP 설정 모드 진입
R1(config-router)#version 2  //버전 지정
R1(config-router)#network 1.0.0.0  //메이저 네트워크 지정
```

* 메이저 네트워크: 서브네팅하지 않은 원래의 네트워크
* 설정하고 나서 라우팅 테이블을 보면 R 로 시작하는 정보를 볼 수 있는데 이는 RIP로 부터 광고받은 라우팅 정보다
{: .notice}

* RIPv2 패킷 포맷
* 출발지 IP, 목적지 IP, 프로토콜(번호), 출발지 포트, 목적지 포트, 라우팅 정보(목적지 네트워크, 서브넷 마스크 길이, 홉카운트 등)
{: .notice}

```
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     1.0.0.0/24 is subnetted, 3 subnets
C       1.1.12.0 is directly connected, FastEthernet0/0
R       1.1.23.0 [120/1] via 1.1.12.2, 00:00:15, FastEthernet0/0
R       1.1.34.0 [120/2] via 1.1.12.2, 00:00:15, FastEthernet0/0
```

RIP 동작 디버깅
{: .notice}
```
R1#debug ip rip
RIP protocol debugging is on
R1#
*Mar  1 00:15:19.803: RIP: sending v2 update to 224.0.0.9 via FastEthernet0/0 (1.1.10.1)
*Mar  1 00:15:19.803: RIP: build update entries
*Mar  1 00:15:19.803:   1.1.12.0/24 via 0.0.0.0, metric 1, tag 0
R1#
*Mar  1 00:15:27.971: RIP: sending v2 update to 224.0.0.9 via FastEthernet0/1 (1.1.12.1)
```