---
title: "Security: 방화벽 NAT"
last_modified_at: 2020-08-25T20:20:02-05:00
categories:
  - Security
tags:
  - Firewall
  - ASA
  - NAT
toc: true 
toc_label: "Table of Contents"
toc_icon: "cog"
toc_sticky: true 
author_profile: true 
read_time: false 
---

---
### 토폴로지 설정
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_nat1.jpg" alt="">
  <figcaption> </figcaption>
</figure>

위와 같이 R1 ~ R4 인터페이스에 주소를 할당해준다.
{: .notice}

```console
R1#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.10.1       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.1.1        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```console
R2#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.23.2       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.2.2        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```console
R3#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.23.3       YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            10.1.3.3        YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```
```console
R4#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            1.1.40.4        YES manual administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            1.1.4.4         YES manual administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
```

방화벽의 인터페이스에 nameif로 inside, dmz, outside을 설정해준다. 
{: .notice}

```console
ciscoasa> enable
Password:
ciscoasa# conf t
ciscoasa(config)# hostname FW1
FW1(config)# end
FW1# copy r s
FW1# reload

FW1# conf t
FW1(config)# int gi 0/0
FW1(config-if)# nameif inside
INFO: Security level for "inside" set to 100 by default.
FW1(config-if)# ip add 10.1.10.10 255.255.255.0
FW1(config-if)# no shut

FW1(config-if)# ping 10.1.10.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.10.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 10/24/70 ms

FW1(config-if)# int gi 0/1
FW1(config-if)# nameif dmz
INFO: Security level for "dmz" set to 0 by default.
FW1(config-if)# security-level 50
FW1(config-if)# ip add 10.1.23.10 255.255.255.0
FW1(config-if)# no shut
FW1(config-if)# end

FW1# conf t
FW1(config)# int gi 0/2
FW1(config-if)# nameif outside
INFO: Security level for "outside" set to 0 by default.
FW1(config-if)# ip add 1.1.40.10 255.255.255.0
FW1(config-if)# no shut
```

설정이 다 되었으면 Ping으로 연결이 잘되었는지 확인한다.
{: .notice}

```console
FW1# ping 10.1.23.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.23.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/20 ms

FW1# ping 10.1.23.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.23.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/26/50 ms

FW1# ping 1.1.40.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.40.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 10/22/40 ms
```

이어서 ospf 설정을 해주고 모르는 패킷이 도착할 경우 1.1.40.4 로 포워드 하도록 설정해준다.
{: .notice}

```console
FW1# conf t
FW1(config)# route outside 0.0.0.0 0.0.0.0 1.1.40.4
FW1(config)# router ospf 1
FW1(config-router)# network 10.1.10.0 255.255.255.0 area 0
FW1(config-router)# network 10.1.23.0 255.255.255.0 area 0
FW1(config-router)# default-information originate
FW1(config-router)# end
FW1# copy r s
```

R1 ~ R4도 설정을 해주자.
{: .notice}

```console
#R1
conf t
router ospf 1
network 10.1.10.0 0.0.0.255 area 0
network 10.1.1.0 0.0.0.255 area 0

#R2
conf t
router ospf 1
network 10.1.23.0 0.0.0.255 area 0
network 10.1.2.0 0.0.0.255 area 0

#R3
conf t
router ospf 1
network 10.1.23.0 0.0.0.255 area 0
network 10.1.3.0 0.0.0.255 area 0
```

nat 설정을 할 구간은 FW1의 gi 0/2와 R4의 f0/0 이다. 공인 IP로 2.2.2.0을 사용할 것이므로 
2.2.2.0 주소 대역대로 부터 패킷이 오면 1.1.40.10 으로 넘겨준다.
{: .notice}

```console
R4#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#ip route 2.2.2.0 255.255.255.0 1.1.40.10
```

```console
FW1# show route

Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, V - VPN
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, + - replicated route
Gateway of last resort is 1.1.40.4 to network 0.0.0.0

S*       0.0.0.0 0.0.0.0 [1/0] via 1.1.40.4, outside
C        1.1.40.0 255.255.255.0 is directly connected, outside
L        1.1.40.10 255.255.255.255 is directly connected, outside
O        10.1.1.0 255.255.255.0 [110/20] via 10.1.10.1, 00:04:12, inside
O        10.1.2.0 255.255.255.0 [110/20] via 10.1.23.2, 00:05:15, dmz
O        10.1.3.0 255.255.255.0 [110/20] via 10.1.23.3, 00:03:19, dmz
C        10.1.10.0 255.255.255.0 is directly connected, inside
L        10.1.10.10 255.255.255.255 is directly connected, inside
C        10.1.23.0 255.255.255.0 is directly connected, dmz
L        10.1.23.10 255.255.255.255 is directly connected, dmz
```

---
### 방화벽 NAT
---


NAT(Network address translation)는 관리자가 지정한 IP주소나 네트워크 대역 또는 포트번호를 변화하여
외부로 전송한다. IPv4의 주소 고갈 문제해결, 변환된 주소로 통신하여 보안을 강화하는 목적이 있다.
{: .notice}

* **NAT 종류**
* **정적 NAT/PAT**: 주소 변환에 필요한 정보를 NAT 테이블에 반영구적으로 저장. 어느 방향에서도 통신을 시작할 수 있다.
정적 PAT는 TCP/UDP 포트 번호까지 변환할 수 있다. 예로 서로 다른 주소를 가진 서비스들을 같은 주소의 다른 포트번호를 가지도록 설정할 수 있다.
* **동적 NAT/PAT**: 동적 NAT는 정책에 부합하는 트래픽이 발생하는 순간 변환 주소가 할당된다. NAT 테이블에 임시로 저장이 되고 통신이 끝나면 제거된다.
 따라서 반대방향에서는 통신을 시작할 수 없다. (평소 테이블에 아무 정보가 없기 때문이다.) 제거 시간은 timeout xlate 명령어로 변경할 수 있다.
  동적 PAT는 사실 IP와 포트 번호를 공인 IP 주소와 1024 이후의 포트 번호로 변환한다. 
* **폴리시 NAT/PAT**: 폴리시 NAT는 출발지와 목적지에 따라 변환이 일어난다. 출발지, 목적지에 따라서 다르게 변환한다. 정책 기반 NAT라고도 볼 수 있다.
* **바이패스 NAT**: VPN 동작시 NAT를 통해 주소변환이 동작하면 안된다. 이러한 상황에서 쓰이는 NAT이며 특정 출발지와 목적지를 가진 패킷만 
주소변환을 하지 않고 라우팅 된다.
{: .notice--info}


```console
예시)정적 NAT
사설 IP			공인IP 
10.1.1.1		2.2.2.101:ANY
10.1.2.2		2.2.2.102:ANY
예시)정적 PAT
사설 IP			공인IP
10.1.1.1:80		2.2.2.100:80
10.1.2.2.:21	2.2.2.100:21
```

* **NAT 구현 방식**
* **오브젝트 NAT(오토 NAT)**: 오브젝트 안에서 주소 변환 대상과 변환할 IP 또는 IP 대역을 설정한다. 
간단하고 가장 많이 사용한다. 설정 순서 상관없이 세부적인 정책일수록 NAT 테이블 상위에 등록된다.
* **트와이스 NAT(매뉴얼 NAT)**: 출발지와 목적지 주소를 모두 참고하여 주소 변환이 가능한 방식이다.
예로 들어, 특정 출발지 주소를 가진 패킷이 특정 목적지를 향할 때 주소를 변환한다. 오토 NAT와는 다르게 
설정 순서대로 NAT 테이블에 등록되고 관리자가 직접 순서를 제어한다.
{: .notice--info}

* **NAT 동작 순서**
* 매뉴얼 NAT
* 오토 NAT
* 메뉴얼 NAT(after-auto 옵션을 사용한 경우)
{: .notice--warning}

* NAT 설정은 **트랜스패런트 모드**와 **라우터 모드**에 상관없이 설정 가능하지만 다음과 같은 **제약 사항**이 있다.
* any 키워드를 사용할 수 없고 실제 주소와 변환 주소를 명시해야한다.
* 인터페이스 PAT 설정이 불가능하다. (트랜스패런트는 스위치 처럼 동작해서 인터페이스에 IP 주소가 없을 수 있다.)
* IPv6, IPv4간의 변환은 지원하지 않는다.
* **트랜스패런트 모드**는 내부망 사이에 통신을 검사하고 싶을 때 사용
* **라우터 모드**는 라우터와 라우터 사이의 통신을 검사할 때 사용
{: .notice--warning}

```console
Router, NAT(N:N)방식
1.	사설 ip 대역 지정 (ip access-list standard Private)
2.	공인 ip 대역 지정 (ip nat pool Public start end)
3.	사설 ip 대역, 공인 ip 대역 매핑(ip nat inside source list Private pool Public)

ASA, NAT(N:N)
1.	사설 ip 대역 지정(object-group network Private)
2.	공인 ip 대역 지정(object-group network Public)
3.	사설 Ip대역, 공인 ip 대역 매핑 nat (inside, outside) 
```

**오브젝트 nat**  
오브젝트를 만들면서 그냥 nat처리를 할 수 있다. 오브젝트 nat는 출발지만을 변환한다.
Nat의 대부분의 경우 도착지 주소를 바꿀 필요가 없으니 Inside local 주소에서 insisde global 주소로 
출발지 주소를 변환한다. 그래서 자주 쓰인다는 것이다.
{: .notice}

```console
inside local - > real source  (실제 사용하는 주소)
inside global - > mapped source (바뀌는 주소)

outside local -> real destination (바깥 도착지가 실제 사용하는 주소)
outside global -> mapped destination (공인 망을 지나서 찾아오기 위한 주소?)
```

---
### 실습 1 (오브젝트, 정적 NAT)
---

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_nat2.jpg" alt="">
  <figcaption> </figcaption>
</figure>

설정한 토폴로지를 보자. R2의 10.1.23.2를 출발지로, R4의 1.1.40.4를 목적지로 패킷을 보낸다고 하자.
{: .notice}


`처음 출발할때 패킷 상태`  

|  출발지 IP  |  출발지 포트 번호  |  목적지 IP  |  목적지 포트  |    
| ------ | ------- | ------- | ------- |   
| 10.1.23.2 | 1024 ~ | 1.1.40.4 | 23 |   

`출발지 주소가 아래와 같이 mapping`  

|  출발지 IP  |  출발지 포트 번호  |  목적지 IP  |  목적지 포트  |   
| ------ | ------- | ------- | ------- |   
| 2.2.2.100 | 1024 ~ | 1.1.40.4 | 23 |   

정적 NAT 설정시, R4에서 R2로도 먼저 연결이 가능하다.
{: .notice}


`처음 출발할때 패킷 상태`  

|  출발지 IP  |  출발지 포트 번호  |  목적지 IP  |  목적지 포트  |   
| ------ | ------- | ------- | ------- |   
| 1.1.40.4 | 1024 ~ | 10.1.23.2 | 23 |   

`목적지 주소를 아래와 같이 mapping`  

|  출발지 IP  |  출발지 포트 번호  |  목적지 IP  |  목적지 포트  |   
| ------ | ------- | ------- | ------- |   
| 1.1.40.4 | 1024 ~ | 2.2.2.100 | 23 |   

nat 설정을 하기 전에 R2에서 R4로 ping을 해보자. R4는 NAT 설정을 위해 ospf을 해주지 않았다. 
{: .notice}

```console
R2#ping 1.1.4.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_nat3.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```console
FW1# conf t
FW1(config)# object network dmz_Server  	//단일 오브젝트를 만들어주자
FW1(config-network-object)# host 10.1.23.2 //ip 주소 할당
//nat ( 어디서, 어디로 ) static < mapping 주소 >
FW1(config-network-object)# nat (dmz,outside) static 2.2.2.100
FW1(config-network-object)# exit
```
```console
FW1(config)# policy-map global_policy
FW1(config-pmap)# class inspection_default
FW1(config-pmap-c)# inspect icmp
FW1(config-pmap-c)# show xlate
1 in use, 1 most used
Flags: D - DNS, e - extended, I - identity, i - dynamic, r - portmap,
       s - static, T - twice, N - net-to-net
NAT from dmz:10.1.23.2 to outside:2.2.2.100
    flags s idle 0:04:52 timeout 0:00:00
```

```console
R2#ping 1.1.4.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.4.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/31/44 ms
```

<figure class="align-center">
  <img src="{{ site.url }}{{ site.baseurl }}/assets/images/Topology/asa_nat4.jpg" alt="">
  <figcaption> </figcaption>
</figure>

```console
FW1# conf t
FW1(config)# object network dmz_Server3
FW1(config-network-object)# host 10.1.23.3
FW1(config-network-object)# nat (dmz,outside) static 2.2.2.102

FW1# conf t
FW1(config)# access-list OUTSIDE-IN permit icmp any any
FW1(config)# access-group OUTSIDE-IN in int outside

R4#ping 2.2.2.102

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 2.2.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 24/35/52 ms
```
```
//다시 access-list 제거
FW1(config)# no access-group OUTSIDE-IN in int outside
FW1(config)# no access-list OUTSIDE-IN permit icmp any any
```

---
### 실습 2 (오브젝트, 정적 NAT)
---

```console
//object-group 만드는 방법
//방법1
Object-group network dmz-Servers
Network-object host 10.1.23.2
Network-object host 10.1.23.3
//방법2
Object network dmz-Server2
Host 10.1.23.2
Object network dmz-Server3
Host 10.1.23.3
Object-group network dmz-Servers
Network-object object dmz-Server2
Network-object object dmz-Server3
```

이전 실습에서 아래와 같이 주소 mapping 설정한 것을 기억해두자
{: .notice}

```console
//10.1.23.2과 2.2.2.100을 mapping
FW1(config)# object network dmz_Server
FW1(config-network-object)# host 10.1.23.2 //ip 주소 할당
FW1(config-network-object)# nat (dmz,outside) static 2.2.2.100
//10.1.23.3과 2.2.2.102를 mapping
FW1(config)# object network dmz_Server3
FW1(config-network-object)# host 10.1.23.3
FW1(config-network-object)# nat (dmz,outside) static 2.2.2.102
```

telnet을 이용하여 test하기 위해 아래와 같이 패스워드 설정을 해준다.
{: .notice}

```console
#R2 R3 R4
conf t
line vty 0 4
password cisco
login
end
```

R2에서 1.1.4.4 로 Telnet 연결 후 R4에서 유저 정보를 확인해 보자.
{: .notice}

```console
R2#telnet 1.1.4.4
Trying 1.1.4.4 ... Open


User Access Verification

Password:
R4>
```

object nat를 통해 정적으로 mapping한 주소가 나타난다.
{: .notice}

```console
R4#show users
    Line       User       Host(s)              Idle       Location
*  0 con 0                idle                 00:00:00
 162 vty 0                idle                 00:00:18 2.2.2.100

  Interface    User               Mode         Idle     Peer Address
```

마찬가지로 R3에서 1.1.4.4로 연결한 후 정보를 확인해보자.
{: .notice}

```console
R3#telnet 1.1.4.4
Trying 1.1.4.4 ... Open


User Access Verification

Password:
R4>
```

static하게 mapping한 주소가 나타남을 볼 수 있다.
{: .notice}

```console
R4#show users
    Line       User       Host(s)              Idle       Location
*  0 con 0                idle                 00:00:00
 162 vty 0                idle                 00:00:47 2.2.2.100
 163 vty 1                idle                 00:00:06 2.2.2.102

  Interface    User               Mode         Idle     Peer Address
```

R4에서 2.2.2.100를 통해 R2 로 접근할 수 있는데 이때 ACL 설정이 필요하다.(outside에서 inside로 가니까)  
Access-list OUTSIDE-IN permit tcp any host 2.2.2.100 eq 23	Mapped source  
Access-list OUTSIDE-IN permit tcp any host 10.1.23.2 eq 23	Real source  
둘 중에 무엇을 열어주는게 좋을까 ?  
아래가 더 좋다. Mapped 주소는 바뀔수도 있기 떄문이다.  
{: .notice}

기존방식으로 ACL 설정
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN permit tcp any host 10.1.23.2 eq 23
FW1(config)# access-group OUTSIDE-IN in int outside
```

```console
R4#telnet 2.2.2.100
Trying 2.2.2.100 ... Open


User Access Verification

Password:
```

object를 이용하여 ACL 설정
{: .notice}

```console
FW1(config)# access-list OUTSIDE-IN permit tcp any object dmz_Server3 eq 23
```

```console
R4#telnet 2.2.2.102
Trying 2.2.2.102 ... Open


User Access Verification

Password:
R3>
```

```console
FW1(config)# show nat

Auto NAT Policies (Section 2)
1 (dmz) to (outside) source static dmz_Server 2.2.2.100
    translate_hits = 3, untranslate_hits = 3
2 (dmz) to (outside) source static dmz_Server3 2.2.2.102
    translate_hits = 11, untranslate_hits = 2
FW1(config)# show xlate
2 in use, 2 most used
Flags: D - DNS, e - extended, I - identity, i - dynamic, r - portmap,
       s - static, T - twice, N - net-to-net
NAT from dmz:10.1.23.2 to outside:2.2.2.100
    flags s idle 0:06:33 timeout 0:00:00
NAT from dmz:10.1.23.3 to outside:2.2.2.102
    flags s idle 0:02:27 timeout 0:00:00
```



































